{
  "name": "Multitype",
  "type": "ability",
  "img": "systems/ptr2e/img/icons/ability_icon.webp",
  "system": {
    "actions": [
      {
        "traits": [
          "legendary",
          "interrupt-7"
        ],
        "name": "Multitype",
        "slug": "multitype",
        "type": "generic",
        "cost": {
          "activation": "free",
          "powerPoints": 1,
          "trigger": "<p>The user declares Judgment.</p>"
        },
        "range": {
          "target": "self",
          "unit": "m"
        },
        "description": "<p>Trigger: The user declares Judgment.</p><p>Effect: The user may change the Type of the triggering attack to any available Type of their choosing (except Typeless) for the rest of their Activation.</p>",
        "img": "icons/svg/explosion.svg"
      },
      {
        "traits": [
          "legendary"
        ],
        "name": "Multitype",
        "slug": "multitype",
        "type": "passive",
        "cost": {
          "activation": "free"
        },
        "description": "<p>Passive: The user can equip a Type Plate item without using their Accessory Slot, and the user's type changes to match the Type Plate. If the user has two different Type Plates equipped, the user gains both types. If the user possesses the Legend Plate, Judgement instead always receives STAB and always deals damage as if it was one step super effective.</p>",
        "img": "icons/svg/explosion.svg"
      }
    ],
    "description": "<p>Trigger: The user declares Judgment.</p><p>Effect: The user may change the Type of the triggering attack to any available Type of their choosing (except Typeless) for the rest of their Activation. Passive: The user can equip a Type Plate item without using their Accessory Slot, and the user's type changes to match the Type Plate. If the user has two different Type Plates equipped, the user gains both types. If the user possesses the Legend Plate, Judgement instead always receives STAB and always deals damage as if it was one step super effective.</p>",
    "traits": [
      "legendary"
    ],
    "slug": "multitype",
    "_migration": {
      "version": null,
      "previous": null
    }
  },
  "_id": "HJnjAGEDc4lmRMP4",
  "effects": []
}