[{"name":"rules","pages":[{"name":"rules","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: The Rules\r\ndescription: Welcome to PTR2e!\r\npublished: true\r\ndate: 2024-06-12T11:38:46.466Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-04-03T21:17:06.694Z\r\n---\r\n\r\n# Basic Introduction - The d100 & Clocks \r\n## d100\r\nThe use of a universal **d100** for handling Accuracy, Skill, and a plethora of other rolls is a fairly simple system: take a specific DC in question (for Skills, it's the roller's Skill level plus/minus situational modifiers, for Captures, it's flat rolls against the CritCapture DC and Shake DC), and roll a d100. If the roll is less than or equal to the DC, you succeed! If it's greater than the DC, you fail.\r\n\r\n## Clocks\r\n\r\nA **Progress Clock** is a tool for tracking various mechanics in PTR2e, from traveling between towns, to tracking progress on a crafting project, and even providing a good visual when a boss’ super attack will trigger. The fundamental use of a Progress Clock is to handle complex activities that cannot be resolved within a single check, and are a tool for GMs to pace out a scenario.\r\n\r\nFor PTR2e, there are two categories of Progress Clocks: **Specific Clocks** and **Flexible Clocks**.\r\n\r\n**Specific Clocks** are used when a rule is being called in the system. These are always given an amount and context for the clock being used. Specific Clocks are designed with intent to create a balanced sense of pacing for the related rule. \r\n\r\n**Flexible Clocks** are for scenarios not covered in the rules. These are open to the GM to set up in any way they wish.\r\n\r\n### Spans\r\nClocks are simple circles split into separate segments, called **Spans**. Each Span in a Clock represents a step towards an objective being completed or an event starting. Clock can have as few as 2 Spans, and can have as many Spans the GM feels is appropriate, though we recommend not going over 12 Spans.\r\n\r\n### Advancing and Set-Backs\r\nWhenever a Clock is being used, a list of factors is provided that can either **Advance** the clock or cause a **Set-Back**. When the clock is Advanced, a Span is filled in. Once all Spans are filled in, whatever event or activity the clock was for begins. Set-backs clear a filled Span, or can add additional blank Spans to a clock. \r\n\r\nCommon factors that can Advance the clock or cause a Set-Back include:\r\n- Passing/failing a skill check\r\n- Rounds passing in combat\r\n- Creative uses of actions\r\n\r\nThe factors for Flexible Clocks are always determined by the GM.\r\n\r\n### The Day Clock\r\n\r\nTo facilitate an abstract method of tracking the time where activity is more relevant than specific absolute time, the system uses what we call the Day Clock. It is a 5-Span Clock that covers Morning, Day, Afternoon, Evening, Night. The GM can determine at which point it feels appropriate to advance to the next span of the Day Clock as they wish, and we will provide some specific examples that should advance the day clock, such as interacting with the Camping system.\r\n\r\n### The Danger Clock\r\n\r\nWhere there is an approaching hazard or time limit to achieve something, the GM can employ what we call a Danger Clock. The Danger Clock is a clock which counts down towards a problematic or dangerous event occuring, such as time running out to explore a Mystery Dungeon and a great wind ejecting the explorers from the area, or a countdown to an encounter with enemies searching for the party.\r\n\r\nTo utilise a Danger Clock, you should first establish the nature of the looming threat. Once you've done that, you can determine how large the clock should be and how quickly it should fill.\r\n\r\nA Danger Clock can be any number of spans you want it to be, but it is important to consider that the less spans there are on the clock, the faster it will fill and the more imminently the danger will arrive. Too many spans, and players may feel that there is no tension or sense of urgency. Too few, and the clock may feel punitive.\r\n\r\nA good rule of thumb is to count how many 'significant actions' you want to pass before the clock expires and the hazard arrives. Anywhere between 4 and 10 might be good, as more or less spawns is likely too many or too few. The 'right answer' here will depend on how much wiggle room you want the players to have been the starting point and their goal while maintaining a sense of tension.\r\n\r\nSome example danger clock sizes with explanations;\r\n\r\n- Eight sections for a threat that isn't immediately obvious and will only come true with time — something like \"crumbling temple\" or \"power plant meltdown\".\r\n\r\n- Six sections for a threat that is quite obvious and likely to happen after a while — such as \"powerful wandering Pokemon\" or \"poisonous fog gradually filling the structure\".\r\n\r\n- Four sections for a threat that is urgent and very likely to happen — something like \"surrounded\" or \"high alert\" in a dungeon brimming with hostile creatures, where the Danger Clock filling would result in an immediate deadly encounter.\r\n\r\nGenerally speaking, when in a 'dungeoneering' environment, a danger clock should tick up for each exploration action the party accomplishes, but don't be afraid to alter the scope of this to suit the needs of the story you're trying to tell.\r\n\r\n\r\n### Random Event Clock\r\n\r\nWhile not quite the same thing, you may wish to use a Clock in a similar manner to the Danger Clock, where a random event takes place once this Clock has counted down - perhaps prompting the likes of a Luck roll to determine how positive or negative this event might be. Consider this a more structured way to approach the concept of 'random encounters' in your world.\r\n\r\n### Racing Clocks\r\n\r\nThere will be occasions, typically where two parties are working in competition with one another, where you will want to use Racing Clocks. These clocks are typically Flexible Clocks and are used when either two parties are in opposition with one another, or the players are trying to complete a task before a danger clock fills - such as evacuating a town before the Volcano erupts. For this, players can seek ways to advance their own clocks or sabotage the opposing clock.\r\n\r\n## Keywords and Traits\r\nInspired off of the keywords and traits as used by the various *Warhammer* franchise games and *Pathfinder: Second Edition*, PTR2e includes a variety of **<Keyword\\>s** and **[Trait]s** in order to classify things and grant rules.\r\n\r\n<Keyword\\>s are fairly straight forward in that they are a category or collection of [Traits] and are used where you want to define a range of [Traits] but not necessarily a specific one. At its most basic, a **[Trait]** is generally a number of tags underneath a broader <Keyword\\>, which acts as a whole category. However [Traits] themselves, are multi-purpose, interacting with different aspects of the game depending on where they're found. Some of them even have specific rules attached to them in a fashion similar to the Capabilities mechanic or the keywords on certain Moves from PTR.\r\n\r\nThis can serve, for example, as a prerequisite for a Perk. To give something a little more illustrative, there is a <Type\\> keyword, which contains a number of traits such as [[Fire]](/traits/fire), which permits access to a number of Fire-Type centered Perks on the web.\r\n\r\nThe [[Quadruped]](/traits/quadruped) designation meanwhile is used as part of the process of designing your own Pokémon species to help you identify the base movement allowances of that species. On a more general level, you'll see more direct rules-interfacing traits like [[Darkvision]](/traits/darkvision) or [[Blast X]](/traits/blast), or things like traits such as [[Venomous]](/traits/venomous) gives the ability to grant Poison-Typing to actions/attacks with the [[Adaptable]](/traits/adaptable) Trait.\r\n\r\n<blockquote class=\"is-info line\">\r\n  \r\n### So how does this work in Foundry?\r\nThe <Keyword\\> and [Trait] system will be integrated with Foundry's automations, enabling a ton of quick-reference and easily-appliable goodness:\r\n- **Trait/Keyword based Searching for Perks/Moves/Abilities/Etc.**\r\n  - Looking for all those [Adaptable] moves to use with your [Venomous] trait?\r\n- **Trait-Based Rule Lookup**\r\n\t- Including build-in on-hover with related information look-up!\r\n- **Trait-Based Foundry Automation**\r\n  - No more having to give each [+HP] feat their own rules\r\n- **Uniform Language**\r\n\t- No more \"Does this rule also talk about XYZ\"; rules refer to <Keywords\\> and [Traits], does it have the <Keyword\\>/[Trait]? Yes, no? No!\r\n- **Easy Plug-and-Play for Homebrew Content**\r\n  - Balance & Automation has never been this easy ;)\r\n\r\n</blockquote>\r\n\r\n# Character Creation\r\nCharacter creation is defined in but 9 simple steps! You can read the full details over on the [Character Creation](/rules/character-creation) page.\r\n\r\nNext to this, GMs may wish to also explore [Earning Experience](/rules/earning-experience) to learn more about how they should go about awarding experience for their players to Level-Up!\r\n\r\n# Skills & Skill Checks\r\nYou may be familiar with Skills from other TTRPGs, it's a representation of how good your character is in performing certain types of tasks. \r\n  \r\nThe simple version is: Roll 1d100, did you roll equal to or under your Skill Score? Success! For every 10 above/below the DC you gain one Degree of Success! Didn't like what you rolled? Spend some Luck to improve it!\r\n  \r\nFor the full rules please head on over to the [Skill Checks & Luck page!](/rules/skills)\r\n\r\n# Encounters\r\nThere are many different types of Encounters you may experience during your adventures! \r\nBelow you can find rules for dealing with the most common types of Encounters.\r\n  \r\n## Social Encounters\r\nSocial encounters are your bread & butter when it comes to Roleplaying your in-universe discussion! \r\n  \r\nWhen it comes time to try to convince someone to help you in any way shape or form, it is time to start building Rapport with them, while simultaneously avoiding the ever increasing Tension! \r\n  \r\nThe full details on how this all work can be found over on the [Social Encounters page!](/rules/social-encounters)\r\n\r\n## Combat\r\nBut sometimes talking doesn't quite get both parties to the solution they're looking for, and this may cumulate in a fight!\r\n  \r\nCombat is spread out over a few pages, all of which you can find at the following pages:\r\n- Chapter 1: [Actions & Attacks](/rules/combat/actions)\r\n  - Subchapter: [Making Attacks](/rules/combat/actions#making-attacks)\r\n- Chapter 2: [Initiative](/rules/combat/initiative)\r\n  - Subchapter 1: [Interaction with Conditions & Effects](/rules/combat/initiative#interations-with-other-systems)\r\n  - Subchapter 2: [Action Advancement & Action Delay](/rules/combat/initiative#action-advancement-and-action-delay)\r\n  - Subchapter 3: [Speed Alteration](/rules/combat/initiative#speed-alteration)\r\n  - Subchapter 4: [Example: Combat Round Breakdown](/rules/combat/initiative#combat-round-breakdown)\r\n- Chapter 3: [Cover & Movement](/rules/combat/movement)\r\n- Chapter 4: [Afflictions](/rules/combat/afflictions)\r\n\r\n### Size and Weight\r\nYou can find information on the roles of [Size and Weight right over here!](/rules/size-and-weight)\r\n\r\n## Exploration\r\nWhenever you're not in a fight or working through some downtime, you'll be in what we call 'Exploration Mode', for more info on [how to run Exploration check out this page!](https://2e.ptr.wiki/en/rules/exploration)\r\n\r\n# Capturing Pokemon\r\nOf course what is a Creature Capture TTRPG like ours without well, the capturing of creatures! It works almost identical to the main-line Video Games, but for the full details please check out the dedicated page on [Capturing Creatures!](https://2e.ptr.wiki/en/rules/captures)\r\n\r\n# Gear\r\nWhat else besides rules do you need to capture creatures? Well, of course, the Gear to capture them! For all things Gear, Shopping and how our Cashless-economy model works, you can [check out our Gear page!](/rules/gear)\r\n  \r\n# Downtime & Camping!\r\nSometimes the things you're trying to accomplished can't be measured in the span of \"mere moments and minutes\" like Combat and Exploration. This is what we call Downtime, and is where you spend spans from the Daytime Clock to take certain activities like Crafting or Camping! \r\n  \r\nThe full details on all things [Downtime & Camping, can be found over here!](https://2e.ptr.wiki/en/rules/downtime)\r\n\r\n## Crafting\r\nOne of the most likely activities to be taking during Downtime besides Camping; is Crafting! Allowing you to make items for you and your party to use during the days to come.\r\n  \r\nFor all things Crafting, you can check out the [Crafting Section over on the Gear Page!](/rules/gear#crafting)\r\n\r\n# GM Tips & Suggestions\r\nNot every idea fits every campaign, and because of that some rules will be Optional so every campaign can tailor things to their own needs! For info like optional rules, as well as just generic tips & tricks, please check out the [GM Tips and Suggestions page!](https://2e.ptr.wiki/en/rules/gm-tips)\r\n\r\n# Our Design Choices\r\nAlong the way we've made some basic rules for designing things for the system, whether that's for Species or Perks. If you wonder what general guidelines we followed while designing our system components you can read more about them below:\r\n- [Perk Design](/rules/design/perks)\r\n- [Species Design](/rules/design/species)\r\n- [Moves Design](/rules/design/moves)\r\n\r\n# Foundry Usage\r\n## Basics\r\n## How to install the Alpha\r\n## Alpha manual tricks\r\n\r\n# Alpha Testing\r\n## How to provide feedback\r\n\r\n# Glossary\r\n- Conditions\r\n- List of Definitions","format":2}},{"name":"captures","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Capturing Creatures\r\ndescription: Pokemon, humans, demons, sentient software, you name it! If it has a Capture Rate, there's a way to Capture it!\r\npublished: true\r\ndate: 2024-06-12T11:36:44.878Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-05-09T17:03:00.212Z\r\n---\r\n\r\n# Capturing Creatures\r\nEach Species in this system is likely to have its own **Catch Rate**, which broadly determines the difficulty of capturing that creature (lower is harder to catch, higher is easier to catch). Like the video games, Foundry will simulate both the thrown Ball \"shaking\" and account for \"Critical Captures\".\r\n\r\nWhen a creature is targeted while your Actor is selected, you may attempt to **Capture** it with a Ball or other Capture Tool you possess. First, you must \"Fling\" or \"Use\" (or another appropriate Action) the Ball/tool on the target. Once that Action is successful, to must calculate the **Catch Rate** for this Capture attempt.\r\n\r\nNormally, the Catch Rate calculation is completely automated. However, you will be prompted with a dialog window as you continue with the capture to input any additional, **miscellaneous multipliers** or override other values as instructed by the GM.\r\n\r\nWhen a Capture is being resolved, the Ball \"shakes\" 3 times before catching the target. Practically, this is the result of four successful **Shake Checks**. A Shake Check is a standard d100 roll, its DC influenced by the calculated Catch Rate.\r\n\r\nBut before rolling these Shake Checks, the system will determine if the Capture is a **Critical Capture**. A Critical Capture is also a standard d100, with its DC determined by a number of factors, including the number of Species already caught by the user and other miscellaneous modifiers (including the effects of your Perks). If this roll succeeds, the number of Shake Checks required for successful Capture drops from **4 to 1**.\r\n\r\nAnd if you succeed on all of the necessary Shake Checks, the target is successfully **Caught**!\r\n\r\n_**The order of operations for Captures is as follows:**_\r\n1. Target the creature to be Captured.\r\n2. Select the Actor that will be attempting the Capture.\r\n3. Use the appropriate Action with the Capture Tool you are using (usually \"Fling\" or \"Use\").\r\n4. Once resolving the appropriate Action, use the Capture Action, selecting the Capture Tool.\r\n  a. The Catch Rate calculation occurs, prompting you to input miscellaneous multipliers as needed.\r\n  b. The Critical Capture roll occurs, with a prompt to input miscellaneous multipliers as needed.\r\n  c. The Shake Check(s) occur, with a prompt to input miscellaneous multipliers as needed.\r\n5. If all of the necessary Shake Checks are passed, the creature is Caught!\r\n\r\n# Math for Nerds\r\n> <span style=\"font-size: larger; font-weight: bold;\">Who is this section for?</span>\r\n> This section of the page contains all the mathematical formulas used by the system to make calculations in regards to captures, as well as explanations on what each of their values mean.\r\n> \r\n> This page is <u>***NOT***</u> intended for every user to read and learn how things work, as all this complicated math is handled by the system, after all we want you to focus on enjoying the game, not doing Math homework.\r\n> \r\n> However, some of you may wish to explore the Math more in-depth, to form a higher understanding of the rules, fact-check us, or even help figure out balancing!\r\n> That is why these sections exist.\r\n{.is-danger}\r\n\r\n## Shake Test DC\r\n$$ \r\nDC _{Shake} = \\Bigg\\lfloor 100 * \\bigg( \\frac{\\small CatchRate}{\\small 255}\\bigg)^{3/16} \\Bigg\\rfloor\r\n$$\r\n\r\n## Critical Capture Check DC\r\n$$ \r\nDC _{CritCatch} = \\frac{CatchRate * min (8, 1+caught _{Spec} / 75) *bonus _{Misc}}{357/10} +1\r\n$$\r\nWhere: \r\n- ***caught~Spec~*** – number of species caught by the user.\r\n- ***bonus~Misc~*** – all other bonuses to Critical Captures.\r\n\r\n## Catch Rate Formula\r\n$$\r\nCatchRate = \\Bigg(\\frac{3 * HP _M - 2 * HP_c}{3 * HP_ M}\\Bigg) * rate * bonus_{Ball} * bonus _{Status} * bonus _{Stage} * bonus _{Level} * bonus _{Misc}\r\n$$\r\nWhere:\r\n- ***HP~M~*** – target’s max HP.\r\n- ***HP~c~*** – target’s current HP.\r\n- ***rate*** – target’s Species Capture rate.\r\n- ***bonus~Ball~*** – bonus from used Ball's Catch Rating.\r\n- ***bonus~Status~*** – bonus from Status Afflictions the target has (see below).\r\n- ***bonus~Stage~*** – bonus from Stat Stages the target has (see below).\r\n- ***bonus~Level~*** – VG bonus for catching low level mons (currently unused in PTR2e, discussion underway to instead have level difference between the thrower and target inform this variable). Tentative application below.\r\n- ***bonus~Misc~*** – all other Catch Rate bonuses.\r\n\r\n#### Bonus Status Afflictions Formula\r\n$$\r\nbonus _{Status} = 1.225^{Maj} * 1.05 ^{Min}\r\n$$\r\nWhere:\r\n- ***Maj*** – number of Major Afflictions the target is afflicted with.\r\n- ***Min*** – number of Minor Afflictions the target is afflicted with.\r\n\r\n### Bonus from Stage Effects Formula\r\n$$ \r\nbonus _{Stage} = 1.02^{-net _{Stage}}\r\n$$\r\nWhere:\r\n- ***net~Stage~*** – net quantity of [Stage Change] effects (ATK, DEF, SPATK, SPDEF, SPD, ACC, EVA).\r\n\r\n\r\n### Level Bonus/Penalty\r\n> _Development Note_: still under development.\r\n{.is-warning}\r\n$$ \r\nbonus _{Level} = \\large 0.8^{(\\Delta Level \\div5)}\r\n$$\r\nWhere:\r\n- ***ΔLevel*** – Capturer's Level minus Target's Level.","format":2}},{"name":"character-creation","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Character Creation\r\ndescription: The step-by-step guide on making characters, whether that's Pokemon or Humans!\r\npublished: true\r\ndate: 2024-06-12T11:31:52.694Z\r\ntags: rules, character, level-up, level, advancement, character creation\r\neditor: markdown\r\ndateCreated: 2024-04-19T10:00:52.274Z\r\n---\r\n\r\n# Character Creation\r\n\r\nCreating a character is a straightforward process. There are nine individual steps to it that should be completed in order, though the final step may be appropriate to cut in certain campaign frameworks.\r\n\r\n## 1 - Concept\r\n\r\nThis one is slightly nebulous, but the first thing you should do when making a character is consider what that character will be. What are you trying to achieve? How should this character play? What makes them tick? Do they have any prominent goals or affiliations? What is their history? The more you can come up with at this stage, the easier the rest of character creation should be.\r\n\r\n## 2 - Species\r\n\r\nIn Pokemon Tabletop Reunited: Evolved, you are not necessarily limited to stock Human characters. You may play as a Pokemon, or in a campaign setting that supports it, you may find yourself as the likes of a Dwarf or an Elf. You should check with your GM what species they intend to allow.\r\n\r\nOur recommendation as developers is that you should try to stick to species with the \\[Underdog\\] trait, even if they have later evolutions which cease to be \\[Underdog\\]. For \\[Humanoid\\] type species, all of your Base Stats start at 40, and you have 110 Base Stat Points to allocate. At character creation, you can only increase any single Base Stat up to 90.\r\n\r\nTypically, Humanoids will gain the \\[Trainer\\] trait as part of the game's framework, and Pokemon would gain either \\[Explorer\\] or \\[Expedition Leader\\] traits depending on the nature of the game, but this is not always the case. A GM may wish to run a campaign where \\[Humanoid\\] characters gain the \\[Ranger\\] trait for example instead of \\[Trainer\\]. Check with your GM what comes with your framework as standard.\r\n\r\n## 3 - Allocate Effort Values\r\n\r\nEffort Values (or EVs) are assigned at character creation. There are 508 EVs to be distributed across the 6 stats, and these function almost exactly like they do in the Pokemon Video Games, though we have reduced the cap per individual stat to 200 EVs to reduce minmaxing. Don't worry too much about getting this perfectly right as there are ways in which your EV allocation can be altered during play if it's not working out how you had initially wanted.\r\n\r\n## 4 - Nature\r\n\r\nYou must choose a dominant Nature for your character, regardless of species. This functions exactly like it normally would in terms of it's impact on stats. Be mindful that your character's Nature is not the totality of their personality, but it is meant to be a significant part of it.\r\n\r\n## 5 - Allocate Skills\r\n\r\nAs all player characters receive the \\[Ace\\] trait, they gain a starting Skill Point budget of 400 points to allocate at level 1, while non-player characters (such as owned Pokemon) gain 110 skill points to allocate at level 1.\r\n\r\nAll skills start at 1, or the base rating for your chosen species - whichever is higher. You may spend skill points from your budget to improve any skill you want, at a 1-for-1 ratio, up to a maximum of 90 points in any one skill.\r\n\r\n## 6 - Perks\r\n\r\nAt level 1, \\[Humanoid\\] characters gain 20 advancement points to spend on the Perk Web, while \\[Pokemon\\] characters receive 10 advancement points to spend. These may be used to purchase Perks in the same manner that you would during character advancement. Your first Root node (characterised by the door icon) on the Perk Web is free to purchase.\r\n\r\n## 7 - Gear\r\n\r\nAt this stage, select your starting gear. Typically, \\[Humanoid\\] characters will likely have the \\[Trainer\\] trait and would receive a standard Trainer Kit featuring a stack of basic balls, a stack of potions (and a suitable weapon, if appropriate to the campaign) with room to make additional pre-game shopping rolls or take items as agreed by the GM, while \\[Pokemon\\] characters would receive an Explorer's Kit featuring an Oran Berry and a Status Cure Berry of their choosing, if they have \\[Explorer\\] or \\[Expedition Leader\\].\r\n\r\n## 8 - Determine Starting Luck\r\n\r\nWhile most elements of character creation follow a point-buy basis, for Luck to feel right it should be truly random. As such, you would roll your starting Luck at this stage. To do so, roll 3d6 and multiply the final result by 5. Luck is a resource unique to creatures with the \\[Ace\\] trait.\r\n\r\n## 9 - Choose Starter Pokemon\r\n\r\nFinally, if playing a \\[Trainer\\], \\[Ranger\\], \\[Expedition Leader\\] or similar framework character, you should select your Starter Pokemon. This Pokemon does not receive the \\[Ace\\] trait but should be built using steps 1-6 and step 8 of the character creation process, with the initial skill points being reduced from 400 to 110 due to the lack of \\[Ace\\]. To reiterate, it is our recommendation that, like primary Player Characters, your starter Pokemon should be from a species with the \\[Underdog\\] trait by default, but always check with your GM what options are available in their campaign.\r\n\r\nGMs, we encourage you not to be too strict on what Starter Pokemon are available. Maybe don't allow a Duraludon starter, but don't be too afraid to let someone take a Dratini for example. The likes of psuedo-legendaries ultimately pay for their strength by being late bloomers.\r\n\r\nWhile a character could have a \\[Humanoid\\] companion instead of a \\[Pokemon\\] one, do please ensure that any companion characters do not have the \\[Trainer\\] or \\[Expedition\\] leader traits. In the case of a scenario like a \\[Ranger\\] framework, consider replacing the \\[Ranger\\] trait on any companion characters with \\[Cadet\\].\r\n\r\n# Character Advancement\r\n\r\nCharacter advancement occurs between levels 1 and 100, as you accumulate experience points.\r\n\r\nCharacter advancement is very straightforward in itself. Your stats will automatically increase based on your EV investment.\r\n\r\nAt each level, all actors gain 10 skill points to allocate to their skills, though at this stage the skill cap is lifted from 90 to 100. Evolutions may increase your skills above 100 - this serves to offer a cushion against penalties on skill checks for things your species is naturally adroit at.\r\n\r\nThe Resources skill cannot be improved after character creation through the use of Skill Points. It can only be increased or reduced as a result of gameplay rewards and circumstances, which will be covered in more detail in our GM guidance.\r\n\r\nIn addition to this, characters will receive Advancement Points (or AP). \\[Humanoid\\] characters receive AP at a rate of 1AP per level. \\[Pokemon\\] characters receive AP at a rate of 1 AP per 2 levels, earning an AP every even level. AP are used on the Perk Web to purchase Perks, which will have a cost between 0 and 5 depending on the Perk.\r\n\r\nPokemon unlock ability slots at levels 1, 20, 50 and 80.\r\n\r\nAll characters start at Grade 'E' and improve to Grade 'D' at level 15, then 'C' at level 25, 'B' at level 35 and then 'A' at level 45. Higher grades may require Perks to obtain.\r\n\r\n## Leveling Up\r\n\r\nDuring your Journey in PTR2e one of the questions you’ll undoubtedly stumble upon will be: how are our levels set-up?\r\n\r\nWhile the full answer to this question is still up to debate; for now we have based level-ups around the Experience Tracks as they are in the Pokemon Mainline Video Games, where Humanoids follow the ‘Slow’ track while all Pokemon follow the ‘Faster’ track. The math for both you can view below^[\\[1\\]](#fn2)^, but since you won't be plugging away into your calculator as the math is handled by Foundry, what is more important to know is:\r\n\r\n> ### Rules surrounding level-ups\r\n> \r\n> Whenever a character reaches an EXP Threshold they may immediately level-up; a GM might wish to delay a level-up until after a session or event occurs; but realistically due to the timing of when EXP is earned (more later) this shouldn’t be an issue.\r\n> \r\n> Whenever a level-up occurs, the following happens:\r\n> \r\n> -   Gain +10 to spend amongst any of your Skills (except <Resources>)\r\n> -   Gain +1 Advancement Point, you may immediately spend this in the Perk Web or save it for later.\r\n>     -   This only triggers once every even level if you are a \\[Pokemon\\]\r\n>     -   Perks can only be purchased during level-up or while camping.\r\n\r\nYou can check [here](/rules/earning-experience#earning-experience) to learn more on how GMs should award Experience!","format":2}},{"name":"combat","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Combat\r\ndescription: Category overview page for all Combat Rules.\r\npublished: true\r\ndate: 2024-06-12T11:36:19.818Z\r\ntags: combat, rules\r\neditor: markdown\r\ndateCreated: 2024-04-19T10:05:09.566Z\r\n---\r\n\r\n# Combat\r\n\r\n-   Chapter 1: [Actions & Attacks](/rules/combat/actions)\r\n    -   Subchapter: [Making Attacks](/rules/combat/actions#making-attacks)\r\n-   Chapter 2: [Initiative](/rules/combat/initiative)\r\n    -   Subchapter 1: [Interaction with Conditions & Effects](/rules/combat/initiative#interations-with-other-systems)\r\n    -   Subchapter 2: [Action Advancement & Action Delay](/rules/combat/initiative#action-advancement-and-action-delay)\r\n    -   Subchapter 3: [Speed Alteration](/rules/combat/initiative#speed-alteration)\r\n    -   Subchapter 4: [Example: Combat Round Breakdown](/rules/combat/initiative#combat-round-breakdown)\r\n-   Chapter 3: [Cover & Movement](/rules/combat/movement)\r\n-   Chapter 4: [Afflictions](/rules/combat/afflictions)","format":2}},{"name":"actions","title":{"level":2,"show":true},"text":{"markdown":"---\r\ntitle: Actions & Attacks\r\ndescription: What are actions? Which types are there? How do I use them? How do I resolve an Attack?\r\npublished: true\r\ndate: 2024-06-12T11:33:38.333Z\r\ntags: combat, rules\r\neditor: markdown\r\ndateCreated: 2024-04-19T10:04:29.542Z\r\n---\r\n\r\n# Actions and Activations\r\n\r\nDuring Combat, the game changes into a turn based battle. In Combat, an actor will have a certain number of **Activations** each round (usually one to three), determined by their SPD stat and a number of other factors.\r\n\r\nThe a creature's Activation is composed of two **_Simple Actions_**. Simple Actions are relatively quick to perform without much thought behind them, including the most basic of Attacks. Beyond this, there are other Action Types, many of which are composed of Simple Actions.\r\n\r\n## Complex Actions\r\n\r\n**Complex Actions** require more complicated interactions. Most directly offensive attacks are a Complex Action. Complex Actions consume two Simple Actions, so if you’ve used a Simple Action during an Activation, you cannot use a Complex Action at that time.\r\n\r\n## Priority Actions\r\n\r\n**Priority Actions** are specific actions that allow you to speed up your next Activation. Priority is always defined on an Action with the **\\[Priority X\\]** Trait, where X ranges from 1 to 5. After resolving a \\[Priority X\\] Action, the user’s next Activation is advanced (AV is decreased) by 10% times the value of the Priority Trait (X).\r\n\r\n## Interrupt Actions\r\n\r\n**Interrupt Actions** are Actions that allow you to interrupt another creature’s Activation, defined by the **\\[Interrupt X\\]** Trait. Interrupt Actions are tied to a **Trigger**, which outlines the specific condition when the Interrupt Action can be Activated. Upon using an Interrupt Action, you consume the Action Cost from your next Activation. The amount denoted by the **\\[Interrupt X\\]** Trait denotes the hierarchy of Interrupt priority in the case of multiple Interrupt Actions being declared: Highest Interrupt Level to Lowest, and Lowest Base AV to Highest in case of Interrupt Level ties.\r\n\r\n## Free Actions\r\n\r\n**Free Actions** are the easiest actions, requiring very little focus to do. These are normally part of another action or require a specific trigger to perform. Free Actions do not cost Activations to perform, and can be activated as many times so long as you meet the requirements to activate them, though many tend to be during the Action Phase of your Activation. Free Actions resolve after the triggering action or, if used as part of another action, resolves at the point it was initiated. If an Free Action is an Interrupt, it resolves before the triggering action fully resolves.\r\n\r\n## Delay Actions\r\n\r\n**Delay Actions** are telegraphed actions. Like Priority Actions, these have a level denoted by the **\\[Delay X\\]** Trait, where X ranges from 1 to 3. When you declare an action with \\[Delay X\\], it resolves after X activations have passed or the round ends, whichever comes first. Delay Actions can only be declared on your Activation.\r\n\r\nOn your turn, you can declare the “Hold!” Action, a Free Action that allows you to give \\[Delay X\\] (setting X to a number of your choice, between 1 and 3) to a Complex Action you possess. When doing so, you can instead specify a **Trigger** for the action to become an **\\[Interrupt 1\\]** Action instead. The Trigger you specify can be as general as “anything that enters range will be targeted and attacked” or more specific as needed. Keep in mind that if the Trigger doesn't occur, the action is lost. If the Delay Action is triggered as an Interrupt, you must pay the Action Cost from your next Activation as if it was a regular Interrupt Action.\r\n\r\n# Making Attacks\r\n\r\nTODO: Define the process of declaring an attack, through the resolution of the attack.\r\n\r\n## Effect Triggers\r\n\r\nA number of Actions or Effects have **Triggers**, which are specific conditions that outline the conditions the Action or Effects can be activated. Usually, these are in the \"Trigger\" field of the Action or Effect, but in some occasions may be found in the Effect Text.\r\n\r\nAfter a “triggering condition” occurs (an attack is declared, damage is taken, a Status Condition is/would be applied, an Ability is triggered) there is a window for any other combatant to trigger a reaction effect (aka something that has a trigger that is now met due to the activation of this effect), and this can chain infinitely in theory before returning to the original triggering condition.\r\n\r\nWhen an Effect is declared, or due to occur, actors can trigger effects of their own, as many triggers that are met from this condition but each only once in response to that Effect.\r\n\r\nIf multiple actors wish to trigger their own effects in response to an Effect, those triggered Effects are resolved _in current initiative order_. This means that the resolution of a triggered effect from a \"faster\" actor can invalidate the trigger for a future actor (when an attack hitting is the trigger, Actor B activates Protect in response, and Actor C's \"when an ally hits an enemy\" triggering effect fails because the trigger is no longer applicable).\r\n\r\n# Special Actions\r\n\r\n## Grappling\r\n\r\n**Grapple** is a unique battle state that can be initiated with the \"Grapple\" Action. Grappling, like in other TTRPGs, is used to pin down opponents and for more physical battlefield control.\r\n\r\nBy default, a creature can initiate a Grapple using the Grab Action, though other Actions, Attacks, and Abilities can result in a Grapple. Grab's Accuracy Roll incorporates bonuses and penalties (included as situational ACC stages), as follows:\r\n\r\n-   This roll is based on the difference in Size Categories between the user and the target. This formula is: `(userCatMod-targetCatMod)/2`, rounded up if positive, rounded down if negative.\r\n    -   This makes it so that it's easier for large creatures to grapple smaller ones.\r\n\r\nOn a hit, the user then makes a Lift check, with a Challenge Rating set based on the difference in Weight Classes between the user and the target.\r\n\r\n-   This is calculated as: `(userWC-targetWC) / 2` rounded up if positive or down if negative.\r\n    -   Similar principle to the above, Grappling is easier if you're heavier than your target.\r\n\r\nOn a success, the user and target gain the Grapple Condition, with the user being in control of the Grapple.\r\n\r\n### The Grappled Condition\r\n\r\nWhile creatures possess the Grapple Condition, they have their default ACC and EVA each decreased by 1, and may only take Actions that possess the **\\[Grapple\\]** Trait. Creatures that are not in control of a Grapple are also considered to be Bound, whereas the creature in control of the Grapple may still move themselves normally.\r\n\r\nHowever, the creature in control is treated as having the other participant(s) Mounted onto itself, imposing a penalty to the creature's Movement Scores, equal to:\r\n\r\n`Penalty = mountWC - riderWC + mountLift/10`, where:\r\n\r\n-   `Penalty` < 0\r\n-   `riderWC` is calculated by summing up all of the passenger creatures' weights\r\n\r\nIf this penalty causes a creature to drop to 0 Movement Score overall, they are unable to move themselves and the Grappled creature(s).\r\n\r\n### Additional Participants\r\n\r\nWhenever anyone uses the Grapple Action, any creature that has both the initiator and target of the Grapple within their Reach may voluntarily join the Grapple with the \"Co-Grapple\" Action on whichever side they choose.\r\n\r\nFor the purposes of any Skill Checks made due to an Action with the \\[Grapple\\] trait, that include either the Size or Weight class of the participants in their calculation, you add the total Size / Weight class values of all participants on a side together, including the initial Accuracy Roll and Lift Test.","format":2}},{"name":"afflictions","title":{"level":2,"show":true},"text":{"markdown":"---\r\ntitle: Afflictions\r\ndescription: What are Afflictions? How do they function?\r\npublished: true\r\ndate: 2024-06-12T11:33:47.175Z\r\ntags: combat, rules\r\neditor: markdown\r\ndateCreated: 2024-04-19T10:19:37.030Z\r\n---\r\n\r\nThroughout a battle, a creature can be temporarily afflicted with a affliction. Each affliction has a variety of effects such as dealing damage every Activation or affecting the actions that can be taken.\r\n\r\nWhenever a creature gains an affliction, the affliction has a \"Stack\" value. This value indicates the number of the afflicted creatures' Activations that must pass before the affliction ends. Any time the same Affliction is applied while a creature is afflicted by it, the Stack value from that effect is added to the active Affliction unless otherwise stated. A creature can be afflicted by multiple afflictions.\r\n\r\nUnlike other TTRPGs, most afflictions are not cleared by rolling a \"Save\", and the only way to clear them is by waiting out the number of Activations or using items, moves, and abilities.\r\n\r\nAfflictions are separated into three categories: **Major Afflictions**, **Minor Afflictions**, and **Pseudo Afflictions**.\r\n\r\n# Major Afflictions\r\n\r\nMajor Afflictions have a main effect and usually have other afflictions that apply as long as the Major Affliction is active. These are as follows:\r\n\r\n_Burn_ - The afflicted creature loses a Tick of HP at the end of each of their Activations. The creature has Weak while Burn is active. Fire-Type creatures cannot be Burned.\r\n\r\n_Poison_ - The afflicted creature loses a Tick of HP at the end of each of their Activations. The creature also has Dull while Poison is active.\r\n\r\n_Blight_ - At the end of the afflicted creature’s Activation, it loses X Stacks of Blight, where X is 2 ^of^ ^Activations^ ^passed^ ^with^ ^Blight^ and takes a Tick of HP per Stack lost. The creature also has Dull while Blight is active. When a creature receives Blight, it loses the Poison Affliction, with Blight gaining 33% of its remaining Poison Stacks as extra Stacks on Blight. When afflicted with Poisoned X while Blighted, the creature gains +1 to its Blight Stacks.\r\n\r\n_Paralysis_ - The afflicted creature's Base SPD is reduced by 50%, and the creature may only perform 1 Simple Action on its Activations.\r\n\r\n_Drowsy_ - The Power of all of the afflicted creature's attacks is reduced by 33%, and the creature cannot utilize the \\[Priority X\\] or \\[Interrupt X\\] capabilities of their Actions. The creature also has Distracted while Drowsy is active.\r\n\r\n_Nightmares_ - This affliction can only be applied to Drowsy creatures. The Power of all of the afflicted creature's attacks is reduced by 50%, and the creature cannot utilize the \\[Priority X\\] or \\[Interrupt X\\] capabilities of their actions. The creature loses a Tick of HP at the end of each of its Activations and is Distracted and Slowed while Nightmares is active. When a creature receives Nightmares, it loses the Drowsy Affliction, and gains 33% of its remaining Drowsy Stacks onto Nightmares, and further Nightmares Stacks cannot be applied.\r\n\r\n_Frozen_ - The afflicted creature is unable to use actions (either during its Activations or as interrupts/reactions), but takes 33% less damage from all sources. The afflicted creature has Frail while Frozen is active, and has its Base SPD increased by 50%. Additional Frozen Stacks cannot be added while Frozen is on a creature.\r\n\r\n_Splinter_ - The afflicted creature loses a Tick of HP when they are damaged by a Physical- or Special-Category attack. The creature has Stunted while Splinter is active.\r\n\r\n> _**Note**_: There are talks to possibly make Major Afflictions persistent, rather than being cured after a certain number of Activations.\r\n\r\n# Minor Afflictions\r\n\r\n_Weak_ - The afflicted creature’s default ATK stages are reduced by 1.\r\n\r\n_Dull_ - The afflicted creature’s default SPATK stages are reduced by 1.\r\n\r\n_Frail_ - The afflicted creature’s default DEF stages are reduced by 1.\r\n\r\n_Distracted_ - The afflicted creature’s default SPDEF stages are reduced by 1.\r\n\r\n_Slowed_ - The afflicted creature’s Movement is cut in half, rounding down (minimum 1), and their default SPD stages are reduced by 1.\r\n\r\n_Dazzled_ - The afflicted creature’s default ACC stages are reduced by 1.\r\n\r\n_Vulnerable_ - The afflicted creature’s default EVA stages are reduced by 1.\r\n\r\n_Hindered_ - The afflicted creature’s Skill DCs are reduced by -10. Hindered applied from different sources have their own Stacks.\r\n\r\n_Stunted_ - When the afflicted creature recovers HP, that amount is reduced by 2 Ticks (if the amount after this reduction becomes negative, the afflicted creature instead just doesn’t recover HP at all).\r\n\r\n_Confused_ - At the end of the afflicted creature's Activations, it has a 50% chance of using Fumble.\r\n\r\n_Flinched_ - The creature's Activation is Delayed by their Flinched Stack Value (max 5) x 20%. A creature loses all Stacks of Flinched after its next Activation.\r\n\r\n_Hyper Mode_ - While afflicted with Hyper Mode, the afflicted creature gains +20% to all of its Movement Scores, while dealing and taking 15% more damage. As well, the user’s Shadow-Type attacks gain \\[Crit 1\\], or have their \\[Crit X\\] value increase by +1. At the start of the afflicted creature’s Activations, it has:\r\n\r\n-   a 40% chance to act normally on that Activation,\r\n-   a 25% chance to be Choice-Locked 1 to Shadow-Type attacks,\r\n-   a 15% chance of ending its Activation and using Fumble,\r\n-   a 15% chance of using Backlash, and  \r\n    a 5% chance to be cured of Hyper Mode.\r\n\r\n_Weary_ - While a creature is Weary, its default ACC and EVA stages are based on its Weary value, X. Specifically, the default ACC and EVA stages are set to the negative sum of all X and all integers between 0 and X (Weary 1 sets the defaults to -1, 2 to -3, and 3 to -6). Weary is automatically increased by 1 when a creature Faints. When a creature has 4 or more Weary, it is unable to battle until they reduce their Weary. Weary cannot wear off on its own - a creature must deliberately Rest or consume Items such as Apples to remove Stacks of Weary.\r\n\r\n_Blinded_ - The afflicted creature is unable to see, ocularly. The creature has their \"seeing-based\" vision options disabled (standard vision, Darkvision, X-Ray Vision, etc.) and can only perceive using their other senses (as listed in their Traits). If they do not have a way to see, or have someone guiding them, they are unable to target other creatures with Attacks or Actions.\r\n\r\n_Stuck_ - While afflicted with Stuck, creatures may not leave the combat area. If the afflicted creature is an owned Pokemon, it cannot willingly switch out (or be switched out by another party). When a creature with the \\[Trainer\\] or \\[Ace\\] trait would gain the Stuck affliction; they instead gain Slowed X, rather than Stuck X.\r\n\r\n_Bound_ - The afflicted creature cannot willingly use any <Movement Type>s. Stacks of Bound do not decrease at the end of a creature's Activation, instead the effect that applied Bound will provide a way of removing the Bound Affliction.\r\n\r\n_Disabled_ - One of the afflicted creature’s attacks cannot be used, under any circumstances. The move in question is determined by the source of the disabled effect, usually being “the last attack the target used.” If this would prevent them from using any attack, they may Struggle instead.\r\n\r\n_Nullified_ - One of the afflicted creature’s abilities is negated, and cannot be activated or benefited from. The ability in question is determined by the source of the nullification, usually determined randomly.\r\n\r\n_Suppressed_ - The afflicted creature spends 50% more PP on all actions that use PP.\r\n\r\n_Lifted_ - the afflicted creature is held aloft, unable to act normally. The creature cannot use other than \\[Teleport\\] while Lifted and is otherwise considered Stuck for the duration. A Lifted creature also suffers -6 EVA stages.\r\n\r\n_Raised_ - While a creature is Raised, it is immune to attacks and effects with the \\[Earthbound\\] trait.\r\n\r\n_Harden_ - While under the effect of Harden, the afflicted creature’s \\[Contact\\] attacks have +20 Power, and their \\[Dash\\] attacks gain \\[Crit 1\\] or have their \\[Crit X\\] increase by +1.\r\n\r\n_Sharpen_ - While under the effect of Sharpen, the afflicted creature’s \\[Dash\\] attacks gain \\[Sharp\\], and their \\[Sharp\\] attacks gain \\[Crit 1\\] or have their \\[Crit X\\] increase by +1.\r\n\r\n_Destined_ - when the afflicted creature deals damage with a Damaging Attack to the source of Destined, the afflicted creature is inflicted with the same amount of damage.\r\n\r\n_Disguised_ - The user is not easily recognized by sight. Any creature that attempts to see through Disguised must make a contested Psychology or Spot skill check against the Disguised creature’s Disguise skill, and upon success ignores any effects that require Disguised to be active.\r\n\r\n_Braced_ - while a creature is Braced, its default DEF and SPDEF stages are increased by +2 and its default ATK and SP.ATK stages are decreased by 1. Additionally, a Braced creature is immune to critical damage. A creature loses the Brace affliction after it moves or makes an attack of its own accord.\r\n\r\n_Duel_ - while a creature is afflicted by Duel, the creature and the source of the affliction have \\[Crit 2\\] on attacks they use against one another, and take and deal 33% less damage from/to creatures other than themselves. Pokémon afflicted with Duel or Pokemon that inflict Duel cannot leave battle or be switched out, except from the effects of attacks or abilities. If either the source or afflicted creature Faint or are otherwise removed from battle, the Duel affliction is removed.\r\n\r\n_Engulfed_ - While a creature is afflicted with Engulfed, it is also considered to be Bound and Stuck. While Engulfed the afflicted creature cannot be targeted by Attacks, and it can only target the creature that has Engulfed it with Attacks, although these Attacks are resisted by two stages.\r\n\r\n_Curled_ - while Curled, a creature cannot use Held Items and has +1 default DEF stage. Additionally, moves with the \\[Curl\\] Trait have their Power doubled while their user is Curled.\r\n\r\n_Chanted_ - If an attack were to deal critical damage to a creature with Chanted, the attack instead deals damage as if it were not a Critical Hit.\r\n\r\n_Choice-Locked_ - while Choice-Locked, a creature may only use the last attack or action it used.\r\n\r\n_Grounded_ - While Grounded, creatures become unable to use their \\[Flying\\] movement, nor can they be Lifted or Raised. They are also subject to all active Terrain effects even if they had the \\[Hover\\] Trait.\r\n\r\n_Cursed_ - While Cursed, an afflicted creature loses three ticks of HP at the end of each of their Activations.\r\n\r\n_True Sight_ - The afflicted creature ignores invisibility and illusions.\r\n\r\n_Shrink_ - The afflicted creature’s Size Category is reduced by one.\r\n\r\n_Enlarge_ - The afflicted creature’s Size Category is increased by one.\r\n\r\n_Marked_ - While Marked, all creatures unallied to the afflicted creature and within 8m of it can only target the Marked creature with their attacks. Whenever the creature with Marked is hit by an Attack, reduce the Stack Value of its Marked by 1.\r\n\r\n_Unlucky_ - While Unlucky, a creature cannot utilize its Luck.\r\n\r\n_Perish_ - When a creature’s Perish count hits 0, the creature's HP is set to 0. Humans and ‘Ace’ creatures gain Weary 1 instead of losing HP when their Perish count is 0. The Perish affliction is removed if a creature is switched out or leaves combat.\r\n\r\n_Invisible_ - The afflicted creature vanishes from sight, and cannot be detected by sight based vision or targeted by Attacks. In addition, the creature has +4 default EVA stages.\r\n\r\nInvisible ends when the creature uses an Attack, is hit by an Attack, by using a Free Action to end Invisible, or by the end afflictions of the effect that granted Invisible. Any creature can perform an Intense Spot Check to ignore the effects of Invisible.\r\n\r\n> Invisibility effects subject to change\r\n\r\n_Transient_ - The afflicted creature, while still visible, is able to traverse through any material, as if it wasn’t even there. It may use any of its Movements to move through the air or any substance (as if it were always on or in the appropriate substance), ignoring any and all blocking terrain. The creature also possesses +6 default EVA stages. Creatures that make attacks or actions while Transient deal 75% less damage. The creature loses 5 PP per activation while Transient, and gains a Stack of Weary if it is out of PP while Transient.\r\n\r\n> Transient effects subject to change\r\n\r\n_Fear_ - The afflicted creature suffers penalties based on how many Stacks of Fear they have. *Fear applied from different sources have their own Stacks*.\r\n\r\n-   1 - 2: They cannot willingly move towards the source of their Fear, and suffer -1 ACC stage when attacking the source of their Fear.\r\n-   3+: During each Activation, they must move their full Movement away from the source of their Fear, and suffer -1 EVA stage against attacks made by the source of their Fear.\r\n\r\n_Stockpile_ - The default stages for DEF and SPDEF are increased by +1 for each Stack of Stockpile it possesses. Stockpile can have up to 3 Stacks.\r\n\r\n_Leech_ - The afflicted creature loses two Ticks of HP at the end of each of their Activations and the Source that applied Leech gains HP equal to the amount the afflicted creature lost.\r\n\r\n_Rebound_ - damage inflicted on the afflicted creature by Physical or Special-Category attacks deals ¼ of the inflicted damage on the attacking creature.\r\n\r\n_Ringed_ - when a creature with Ringed concludes an Activation, they heal a Tick of HP, with additional effects from appropriate weathers/terrains as described by the effect that granted Ringed.\r\n\r\n_Enraged_ - A creature may only use Physical- or Special-Category moves while it is Enraged.\r\n\r\n_Charmed_ - The afflicted creature believes the source of Infatuation is a dear friend or romantic interest. Afflicted creatures have a 50% chance of being unable to target the source of their infatuation with an attack, and have -2 stages of EVA against attacks from the source of their infatuation.\r\n\r\n_Taunted_ - The afflicted creature does 33% less damage to creatures other than the source of the Taunted affliction. The afflicted creature cannot use Status-category attacks for the duration of Taunted.\r\n\r\n_Grapple_ - The afflicted creature possesses -1 default ACC and EVA and may only take Actions with the \\[Grapple\\] trait. Creatures that are not in control of a Grapple are also Bound. A creature in control of the Grapple can take a Free Action on their turn to end their participation in Grapple. The creature in control of the Grapple is treated as having the non-in-control creature(s) as being Mounted on itself.  \r\nIf an afflicted creature is the only participant of a Grapple, they lose this affliction.\r\n\r\n# Pseudo Afflictions\r\n\r\n**Pseudo Afflictions** are not technically Status Afflictions, so effects that clear status afflictions or afflictions do not affect Pseudo Afflictions. They also tend to break the “conventional status rules”, so they’re included here.\r\n\r\n_Fainted_ - When a creature's HP reaches and remains at 0, it is afflicted with Fainted. A Fainted creature cannot use Actions, does not benefit from Abilities, and is cured of all \\[Major Affliction\\], \\[Minor Affliction\\], \\[Pseudo Affliction\\], and \\[Stage change\\] effects. Fainted is cured when the afflicted creature's HP is greater than 0. The creature's Weary count increases by 1 whenever they are cured of Fainted.\r\n\r\n\\[Trainers\\] and \\[Expedition Leaders\\] can use the Recall, Send Out and Switch actions while Fainted.\r\n\r\n_Boosted_ - An afflicted creature gains +1 default ATK and SPATK stages.\r\n\r\n_Resolved_ - An afflicted creature gains +1 default DEF and SPDEF stages.\r\n\r\n_Stormcast_ - An afflicted creature deals 20% more damage with attacks that it shares a Type with, and the Range of its \\[Wind\\] attacks increases by 50%.\r\n\r\n_Rapid_ - while afflicted with Rapid, the creature may perform Complex Actions as Simple Actions OR \\[Exhaust\\] Actions are performed as though they lack the Trait OR \\[Set Up\\] Actions set up and resolve on the same activation. The creature has its Initiative delayed by 60% after its Activation and gains Vulnerable 1.\r\n\r\n_Strong_ - while afflicted with Strong, the Power of the creature's Attacks are increased by +20% and has its Initiative delayed by 20% after its Activation.\r\n\r\n_Agile_ - while afflicted with Agile, Power of the creature's Attacks are decreased by -20% and has its Initiative advanced by 20% after its Activation.\r\n\r\n_Precise_ - while afflicted with Precise, the creature has +1 default ACC and has its Initiative delayed by 20% after its Activation.\r\n\r\n_Evasive_ - while afflicted with Evasive, the creature has +1 default EVA and the Power of its Attacks are decreased by -20%.\r\n\r\n_Rapid Fire_ - while afflicted with Rapid Fire, the creature's non-\\[Contact\\] Attacks gain \\[2-Strike\\] or \\[5-Strike\\] (depending on whether Rapid Fire Grade 1 or Grade 2 is applied) and multiply the Power of those Attacks by x0.6 and x0.25 respectively. Existing \\[X-Strike\\] attacks that meet this criteria have their \\[X-Strike\\] value increase by +2 or +5.\r\n\r\n_Desperation_ (**Tentative**) - An entity with 1/3rd of it's Maximum Hit Points remaining or less is considered to be in the Desperation state. This serves as a trigger for various abilities and conditions.","format":2}},{"name":"initiative","title":{"level":2,"show":true},"text":{"markdown":"---\r\ntitle: Initiative\r\ndescription: How does initiative work? What are activations? How are rounds tracked?\r\npublished: true\r\ndate: 2024-06-12T11:35:12.287Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-04-19T10:06:13.049Z\r\n---\r\n\r\n# Initiative\r\nOur Initiative system is a Speed based activation system, akin to what can be found in *Shadowrun*, *Pokemon Legends: Arceus* and *Honkai: Star Rail*.\r\n\r\nThis means that how often and when you go is primarily based on your speed statistic, in our case it is mostly based on the difference in speed between creatures; instead of your pure stat, allowing for nicely flowing combat where (way) higher-level creatures (like bosses) automatically gain the advantage.\r\n\r\nThe very short tl;dr version:\r\n- Creatures act in Ascending Action Value order (Ties are resolved by comparing Base AV -> RNG)\r\n- Whenever someone’s turn begins, everyone's Action Value is reduced by your current Action Value (setting your own to 0)\r\n- Whenever your turn ends, your Action Value is set to your Base Action Value\r\n- The round has a Base Action Value of 100, therefore after 100 Action Value worth of turns has been taken; a new round begins, and always loses ties.\r\n\r\nAll creatures have an **_Action Value_** which decides the order of activations in any given encounter, whenever combat starts and “initiative is rolled”, everyone’s Action Value (the Initiative in Foundry; henceforth referred to as AV) is set to their Base Action Value (henceforth referred to as Base AV) which is calculated based on their **SPD Stat**, as well as the average level of all combatants in the current encounter.\r\n\r\n# Interations with other systems\r\n## Conditions and Effects\r\nA large number of Effects and Conditions many come with a **Stack** value, which indicates the number of the afflicted creatures' activations that must pass before the condition ends.\r\n\r\nFor example, \"Poisoned 3\" means that at the end of your first Activation it goes down to Poisoned 2 -> second activation Poisoned 1 -> and at the end of the third activation the Poison would wear off.\r\n\r\n\"Stacks\", as the name implies, stack with each other, provided that they're the same effect or condition. A creature affected by Poisoned 2 that gets Poisoned 3, will instead of gain 2 instances of Poisoned and now have Poisoned 5. \r\n\r\nSome Effects may cause you to trigger multiple stacks of a condition per turn like Badly Poisoned allowing for an extra potent effect.\r\n\r\n\"Stage changing effects\", like those applied by Leer, Swords Dance, or Curse, work a tad differently. Each of these effects, while having variable effects, still apply unique, independent effects with their own Stacks, ticking down after each Activation. So two instances of Leer on a creature do not \"stack\", adding to the duration of the original effect, but instead are applied in parallel to a creature.\r\n\r\nFor example, if a creature is affected by Leer, takes an Activation of its own, is effect by two more Leer, then starts another Activation, that creature will have unique instances of a Leer 4, a Leer 5, and a Leer 5 effects applied to it on that second Activation.\r\n\r\n# Action Advancing and Action Delay\r\nAction Advancing and Action Delay are two mechanics that can alter a single activation of a creature by moving their turn up or down in the initiative tracker. The formula to calculate is quite simple:\r\n\r\n$$\r\nAV \\tiny 2 \\large = AV \\tiny 1 \\large - AV \\tiny Base \\large * \\bigg(Action Forward-Action Delay\\bigg)\r\n$$ \r\n\r\nSo for example; you have an Action Value of 50 and a Base AV of 100, and you get delayed by 25%, your new Action Value would be `50 - 100 * (0 - 0.25) = 75`. Similarly, advancing forward by 25% would result in a new AV of 25.\r\n## Duration of Action Advancement/Delay \r\nOne thing to keep in mind is that the Action Advancement & Delay stack cumulatively, this means in the example above if you Delay for 25% to a new AV of 75, and then Advance for 25%, you calculate it as `75 - 100 * 0.25 = 50` -> effectively no change.\r\n\r\nIf a turn has passed and your AV has been lowered by 30, leaving you with 45 AV, the advance forward of 25% would still drop you by `25 -> 45 - 100 * 0.25 = 20`\r\n## Advance Forward 100% vs Immediately take Action\r\nExpanding off the above: there is a difference between \"Advancing forward by 100%\" and \"Immediately take action\". Any Effect that Advances Forward by 100% does so using the calculation above; meanwhile an Effect that makes you \"Immediately take action\" sets your AV to 0 with no further math included.\r\n## Advancement and Delay Caps\r\nDue to concerns of outright “locking down” creatures, the absolute highest AV~2~ that can be reached through net increase in AV (meaning, Action Delay exceeding Action Forward) is 100 AV. Advancement, however, has no cap going down besides the absolute limit of 0 AV.\r\n# Speed Alteration\r\nA change in speed of △SPD~1→2~ will lead to a change in Base AV, calculated like so:\r\n\r\n$$\r\nAV _{Base2} = AV _{Base1} * \\frac{SPD _1}{SPD _2} = AV _{Base1} * \\bigg(1- \\frac{\\Delta SPD}{SPD _1 + SPD _2} \\bigg)\r\n$$\r\n\r\nEvery time another SPD (de-)buff is applied it will change the current base AV multiplicatively; this holds true for Speed Combat Stages too. Meaning the speed increase/decrease stacks additively:\r\n\r\n$$\r\nAV_{k} = AV _{Base1} * \\frac{SPD _1}{SPD _2}* \\frac{SPD _2}{SPD _3} *...* \\frac{SPD _{k-1}}{\\small SPD _k}\r\n$$\r\n\r\n$$\r\n= AV _{Base1} * \\bigg( 1- \\frac{\\Delta SPD}{SPD _1 + SPD _{1→k}} \\bigg)\r\n$$ \r\n\r\nThis alteration of the base stat also alters the current speed stat, the calculation for that would be as followed:\r\n\r\n$$\r\nAV _{inew} = AV _{iold} * \\frac{SPD _{old}}{SPD _{new}}\r\n$$ \r\n\r\nMaking the total formula for calculating a change to the current AV the following:\r\n\r\n> equation to-do\r\n\r\n# Combat Round Breakdown\r\n> TODO: Add full example here\r\n\r\n# Math\r\nSee [Math for Nerds](/rules/combat/math-for-nerds) if you wish to see the in-depth math.\r\n\r\n> TODO: Remove equations as much as possible from this page.","format":2}},{"name":"math-for-nerds","title":{"level":2,"show":true},"text":{"markdown":"---\r\ntitle: Math for Nerds\r\ndescription: Over on this page you can find the in-depth math calculations used in the Combat System. Don't worry, you don't need to understand these, but for you math nerds out there, its here so you can fact check us!\r\npublished: true\r\ndate: 2024-06-12T11:34:45.895Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-04-19T10:12:06.841Z\r\n---\r\n\r\n# Math for Nerds!\r\n> <span style=\"font-size: larger; font-weight: bold;\">Who is this page for?</span>\r\n> This page contains all the mathematical formulas used by the system to make calculations, as well as explanations on what each of their values mean.\r\n> \r\n> This page is <u>***NOT***</u> intended for every user to read and learn how things work, as all this complicated math is handled by the system, after all we want you to focus on enjoying the game, not doing Math homework.\r\n> \r\n> However, some of you may wish to explore the Math more in-depth, to form a higher understanding of the rules, fact-check us, or even help figure out balancing!\r\n> That is why this page exists.\r\n{.is-danger}\r\n\r\n## Initiative Math\r\n### Equation\r\nThe SPD stat is calculated as follows:\r\n$$\r\nSPD = \\Bigg\\lfloor \\bigg\\lfloor \\Big( \\big\\lfloor \\frac{2 * Base + \\lfloor \\frac{EV}{4} \\rfloor * Level}{100} \\rfloor + 5 \\Big) * Modifiers * Nature \\bigg\\rfloor * Stage \\Bigg\\rfloor\r\n$$\r\n\r\nAnd Base AV is calculated as follows:\r\n$$\r\nAV _{Base} = \\frac{500 * \\Big( 1+ \\frac{(Average Combat Level - 5) * 21}{95} \\Big)}{SPD} \r\n$$\r\n\r\n### Examples\r\nFor example; you are a level 5 Shuckle with a SPD stat of 5 and the average combat level is 5.\r\n$$\r\nAV_{Base} = \\frac{500 * \\Big( 1+ \\frac{(5 - 5) * 21}{95} \\Big)}{5} = 100\r\n$$\r\n\r\nMeanwhile a level 5 Voltorb with a SPD stat of 15 in the same fight;\r\n$$\r\nAV_{Base} = \\frac{500 * \\Big( 1+ \\frac{(5 - 5) * 21}{95} \\Big)}{15} = 33\r\n$$","format":2}},{"name":"movement","title":{"level":2,"show":true},"text":{"markdown":"---\r\ntitle: Cover & Movement\r\ndescription: How does movement work? What types of movement are there? How do I split movement between different types? How does cover function?\r\npublished: true\r\ndate: 2024-06-12T11:33:54.305Z\r\ntags: combat, rules\r\neditor: markdown\r\ndateCreated: 2024-04-19T10:18:23.974Z\r\n---\r\n\r\n# Movement\r\n\r\nThe distance you can walk, fly, swim, climb, and more is determined by your **Movement Score** and **Movement Types**. Every round you have a total Movement as a resource. Anytime during the Command and Action Phases of your Activation, even during specific Actions, you can use Movement as a Free Action, deducting the amount moved from the appropriate **Movement Allowance**.\r\n\r\nEach Movement Type represents a different mode of movement. To cover a few examples, **Overland** encompasses all traditional on-ground movement (walking, running, etc.), **Swim** includes all in-water movement, and **Flight** covers anything in the air (including what 1e separated out as levitation).\r\n\r\nKeep in mind that Movement is a per round resource. That means if you spend all of your Movement before the round ends, you cannot use any more until the next round. For example if your Movement resource is 10m per round and you have two Activations, if you spend all 10m of Movement on your first Activation, you cannot move anymore on your next Activation.\r\n\r\nWhen you use a Movement Type to move, you deduct 1 from that Type’s **Allowance** for the remainder of the round, as well as 1 from any Types that are _as high or higher than that Type_. To illustrate, let’s take Charizard as an example, which has the Overland and Flight Movement Types, with Movement Scores of 10 and 15 respectively.\r\n\r\nOn its first Activation, if Charizard moves 3m Overland, both its Overland and Fly Allowances for the Round are reduced by 3 (to 7 and 12). But if it decides to then move 4m using its Flight Allowance, only Flight is reduced (to 8), leaving Charizard with 7 Overland and 8 Flight to use for the rest of the Round. Then, at the end of the Round, its Allowances are reset to the Charizard’s default Scores: 10 Overland and 15 Fly.\r\n\r\nIf you find that your movement is insufficient in a given round, you can choose to Rush. Rush is a Simple Action that can add to the Score of a Movement Type you possess for the rest of the round, essentially a gamble to ensure that you can “sprint”. By succeeding at a Skill Test with the Skill associated with the Movement Type you wish to add to (Running for Overland and Flight, Climb for Burrow, Swim for… Swim), you gain +1 to that Movement Type’s Movement Score for every degree of success rolled for the remainder of the Round.\r\n\r\n# Cover\r\n\r\nCertain situations or actions may confer **Cover**, which determines how concealed or \"covered\" a creature is by obstacles, walls, fortifications, or some other mitigating factor that prevents attacks from reaching them.\r\n\r\nBroadly speaking, Cover is generally only applied to Ranged, non-melee attacks, but can sometimes come into play in odd situations, such as with Fog Weather. There are two types of Cover: **Low Cover** and **High Cover**. **Low Cover** is the result of some minor obscuring factors, generally covering up 10-50% of a creature's body. **High Cover** is this, dialed up a fair bit, with 51-90% of a creature being obscured.\r\n\r\n**Lower Cover** confers the equivalent of _+1 default EVA stage_ when it applies as a creature is being targeted by an Action or Attack, while **High Cover** confers _+2 default EVA stages_.","format":2}},{"name":"downtime","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Downtime\r\ndescription: Downtime Activities & Camping!\r\npublished: true\r\ndate: 2024-06-12T11:32:03.213Z\r\ntags: rules, downtime, camping\r\neditor: markdown\r\ndateCreated: 2024-04-28T14:25:58.621Z\r\n---\r\n\r\n# Downtime\r\n\r\n**Downtime Actions** are for Actions that take longer periods of time, beyond the \"moments and minutes\" that Combat and Exploration Actions take.\r\n\r\nGenerally speaking, Downtime Actions relate and interact very closely with the Daytime Spans, always consuming at least one. As part of these Actions, you will generally make some sort of Skill Check, and upon success, you progress that Downtime Action’s own Clock. Upon completing the Clock, you finish the activity and gain the reward from the activity. Many Downtime Activities possess special Clocks that persist from day to day, so you can progress a Clock and continue work on the Activity at another time.\r\n\r\nDowntime Actions consist of activities that may take an hour to do, or could possibly take multiple days or even weeks to resolve. Activities involved with Camping and Resting form a crucial slice of Downtime Actions, but others, such as Travelling, Crafting, and Project Creation are also Downtime Actions. Some Exploration Actions may be used instead as Downtime Actions, with varying effects: either the roll gains an increased bonus, can be done extra times, or has a completely unique effect when used as downtime.\r\n\r\nDowntime in general comes in two chief flavours. There is _structured downtime_, which is primarily constructed around the Camping subsystem, and _flexible downtime_, which typically takes the format of timeskips via the [Interludes optional toolset](/rules/gm-tips#interludes) until gameplay proper resumes again.\r\n\r\n_Structured downtime_ relates to the Day Clock's Spans as discussed above. Downtime Activities pass the Day clock, and the camping subsystem requires the commitment of at least two spans of time from the Day clock, in which one is committed to Rest and the other is dedicated to a Camp Activity.\r\n\r\nIn _flexible downtime_, this is mostly useful as a vehicle to pass a nebulous amount of time - or a fixed one where tracking the individual days would be cumbersome and take away from the gameplay experience. With flexible downtime, it is encouraged to discuss between players and GMs what could reasonably be achieved during the time skip and jump ahead.\r\n\r\n# Camping\r\n\r\nCamping is a downtime subsystem that takes up at least two sections of the standard Day Clock. Of these two spans of time, one must be used for the 'Rest' Camp Action. The other may be used to perform another Camp Action from those that are available to you.\r\n\r\n## Camp Actions\r\n\r\nBelow we will detail the Camp Actions and how you can use them to interact with the game world.\r\n\r\n### Rest and Restore (R&R)\r\n\r\nThe Rest and Restore action fully restores PP spent from the previous day, less any amounts pre-allocated as a result of Camp Actions taken before resting. As part of the Rest action, the effects of any Curry that has been made during this Camp are resolved (such as HP recovery). Rest also normally removes 1 stack of Weary but this can be blocked by the Exposure affliction.\r\n\r\n### Rest - Pokemon Center or Similar\r\n\r\nUsing the services of a Pokemon Center or similar institution, such as a healer, functions like a normal rest, with the exception of fully recovering HP, PP, Weary and Exposure without the use of a meal.\r\n\r\n### Cook\r\n\r\nWhen a character opts to Cook, this allows them to spend time making a meal for the entire encampment. Individual meal recipes have specific effects that are either resolved during the Rest action, or carry over into the next day's play. For the purpose of the latter type of 'food buff', these typically last until the next Camp unless stated otherwise.\r\n\r\n### Change Active Moves\r\n\r\nThis particular Camp Action is considered a 'free' one. It enables you to alter your six active move slots by removing moves from the slot they currently occupy, and by adding moves from your repertoire into unoccupied move slots.\r\n\r\n### Quick-Crafts\r\n\r\n*To be determined.*\r\n\r\n### Learning New Attacks\r\n\r\nCreatures can learn new attacks over the course of a Journey. This can be from leveling up or from tutoring. Below are the rules for each way a creature can increase their Attack Repertoire.\r\n\r\nA creature can learn new attacks from a few methods, but the following basic rules apply regardless of the method\r\n\r\n-   A creature can only learn an attack they have on their Level-up List or their Tutor List.\r\n-   The attack needs to be accessible to learn in some way, either by having another creature that knows the attack teach it, or through some other means such as having the appropriate TM.\r\n\r\nBelow are the core methods for a creature to learn new attacks.\r\n\r\n#### Leveling-up\r\n\r\nCreatures, mainly \\[Pokemon\\], may have a list of attacks they learn when reaching a specific level. These attacks are learned as soon as the creature meets the level requirement for them. Any new attacks are first added to the Active Attacks list if there is free space, and then added to the Attack Repertoire\r\n\r\n#### Tutoring\r\n\r\nNew attacks can be taught via Tutoring. Tutoring is a Camp Action that can be done by any creature using the Teaching skill, and is a simple but time consuming process. In order for a creature to learn a new attack this way, the following conditions must be met:\r\n\r\n1.  A creature must know the desired attack, either on their Active Attacks or in their Attack Repertoire, and must take part in the Tutoring action (if you’re a Trainer facilitating the teaching of an attack one of your Pokemon knows to another Pokemon you have, all three of you participate).\r\n2.  The target creature must be able to learn the attack, either from their level up list or on their Tutor list.\r\n3.  A creature must be designated the Instructor of the Action. This sometimes is the creature that knows the attack, but oftentimes, a Trainer will act as the Instructor for their Pokemon, facilitating the cross-teaching of attacks between their owned Pokemon.\r\n4.  All creatures taking part of the Tutor Activity must be in the active party.\r\n\r\nWhen these conditions are met, a 6 Span Clock is created and the Instructor rolls a Challenging Teaching Skill Check. The creature may substitute their Teaching score for that of another creature involved in the Check, other than the Tutoring target (note: this substitution does not change who the Instructor is for the purposes of Perk effects). This roll is further modified by -20 for every Grade higher the attack is than the Target’s Grade, and conversely gets modified by +10 for every Grade lower the attack is than the Target’s Grade. For every DoS, 1 Span is filled. Every DoF increases the Clock by 1 Span, to a maximum of 12. Once the Tutor Project Clock is filled, the target learns the new attack and adds it to their Active Attack list if there is free space, or to their Attack Repertoire.\r\n\r\n##### Same Type Tutor Bonus (STTB)\r\n\r\nA creature attempting to learn a new attack that matches one of their < Type >\\[Traits\\] treats that attack as 2 Grades lower, to a minimum of E Grade. Grade S and S+ attacks are treated as Grade A for this bonus.\r\n\r\nFor example, a Grade C \\[Ice\\] creature treats Grade A \\[Ice\\] attacks as if they are Grade C when attempting to learn them through Tutoring.\r\n\r\n#### TMs\r\n\r\nTMs are valuable consumable tutoring items that can passively teach a creature a new attack. TMs are written as “TM - < Attack Name >”, and can be acquired from shops, loot or given as prizes. When a TM is applied to a creature that can learn the move it contains, they become unavailable for 2 Spans as a Camp Action. New moves learned from TMs are added to the creature's Active Attacks list if there is free space, or added to the Attack Repertoire.\r\n\r\n##### Crafting TMs\r\n\r\nAny character that picks up the “TM Crafter” Perk can create TMs. This works similar to the Tutoring Camp Action but requires a Blank TM, one corresponding Type Gem, and the user must either know the desired attack or request a willing creature that knows the desired attack to provide it. When a character with TM Crafter starts to craft a TM, a 6 Span Crafting Project is created and a Challenging Electronics or Computers Skill roll is performed. This roll is further modified by -20 for every Grade higher the attack is than the User’s Grade. For every DoS, 1 Span is filled. Every DoF increases the Clock by 1 Span, to a maximum of 12. Once the Crafting Project Clock is filled, the TM is created and the materials are spent.\r\n\r\n> Note: Multiple TMs can be crafted this way from one crafting activity as long as the crafter has the materials available and attacks accessible. Unlike other crafting items, higher DoS do not allow more TMs to be made without spending additional materials.\r\n\r\n### Research\r\n\r\nResearch normally requires you to have access to proper materials, such as a library, and would need to be performed in a town or city. The Scholar perk gives you the means to utilise this action whilst camping out in the wilderness.\r\n\r\nWhen undertaking research, you must first identify the subject matter that you wish to study. The level of obscurity of the information determines the difficulty modifier of the Research skill check, while the level of detail required will determine the size of any Clocks required to complete the task.\r\n\r\n> ### Example Subject Matters and Difficulties\r\n> \r\n> **(+20) Easy** - Finding out who the region's Gym Leaders are and what Pokemon are their Aces.  \r\n> **(+0) Challenging** - Finding out the egg group of an uncommon Pokemon that you are not already familiar with.  \r\n> **(-10) Difficult** - Finding out a list of subsidiary businesses owned by Devon Corp that they choose not to advertise publicly.  \r\n> **(-40) Near Impossible** - Finding out further information about Paradox Pokemon, Ultra Beasts or similar creatures.\r\n\r\nIf appropriate, GMs may wish to split up the information to be uncovered using the Research action and distribute it piecemeal as spans of the relevant Clock are completed.\r\n\r\n### Conceal Camp\r\n\r\nYou may make a Stealth or Survival skill check to hide the location of your camp. If successful, this activity will prevent increases to Danger Clocks that represent wandering hazards while camped. GMs will want to modify the difficulty of this check accordingly to represent the environment and the risk of wandering hazards.\r\n\r\nBe aware! If you were hoping to attract a pokemon with the delicious smell of curry, they may not be able to find a hidden camp!\r\n\r\n### Keep Watch\r\n\r\nIn the event that you lack the necessary skills to conceal your encampment, there is the alternative of Keeping Watch. This action won't prevent your camp being found by enemies, but it will allow you to spot them coming (with a skill check if necessary) to give you time to prepare your allies for danger.\r\n\r\nGMs, avoid making a habit of interrupting Rests with frequent ambushes if you can help it. It can add to the story at times, but don't be surprised if players don't appreciate being hit with challenges while HP and PP deprived and thinking that they're safe to sleep.\r\n\r\n### Breeding\r\n\r\nPlaceholder\r\n\r\n### Therapy\r\n\r\nA Camp Action interacting with Shadow Pokemon. Placeholder.\r\n\r\n### First Aid\r\n\r\nA placeholder for an action interacting with a potential Injuries optional rule.\r\n\r\n### Gather Resources\r\n\r\nYou can perform the Gather Resources exploration action whilst Camping.\r\n\r\n### Fishing\r\n\r\nFishing is a specialised variant of the Search For Pokemon exploration action that can be used whilst Camping. You search for Pokemon like you normally would, but this requires you to be camped within convenient distance of a body of water such as a river, a lake or the ocean. Naturally, this can only be used to find aquatic pokemon in these bodies of water.","format":2}},{"name":"earning-experience","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Earning Experience\r\ndescription: How can you earn Experience, and how should you as a GM award EXP!\r\npublished: true\r\ndate: 2024-06-12T11:37:12.945Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-05-24T13:28:47.267Z\r\n---\r\n\r\n# Leveling Up\r\nDuring your Journey in PTR2e one of the questions you’ll undoubtedly stumble upon will be: how are our levels set-up? \r\n\r\nWhile the full answer to this question is still up to debate; for now we have based level-ups around the Experience Tracks as they are in the Pokemon Mainline Video Games, where Humanoids follow the ‘Slow’ track while all Pokemon follow the ‘Faster’ track. The math for both you can [view below](#exp-math-for-nerds), but since you won't be plugging away into your calculator as the math is handled by Foundry, what is more important to know is:\r\n<blockquote class=\"is-info line\">\r\n\r\n### Rules surrounding level-ups\r\nWhenever a character reaches an EXP Threshold they may immediately level-up; a GM might wish to delay a level-up until after a session or event occurs; but realistically due to the timing of when EXP is earned (more later) this shouldn’t be an issue.\r\n \r\nWhenever a level-up occurs, the following happens:\r\n- Gain +10 to spend amongst any of your Skills (except <Resources\\>)\r\n- Gain +1 Advancement Point, you may immediately spend this in the Perk Web or save it for later.\r\n  - This only triggers once every even level if you are a [Pokemon]\r\n  - Perks can only be purchased during level-up or while camping.\r\n  \r\n</blockquote>\r\n  \r\n# Earning Experience\r\nHowever, to be able to level-up we of course must also be able to earn EXP. There are many different types of activities that will award experience; be it from Combat, Exploration, Contests or even Pokeathlons. Realistically; if an activity is something that isn’t “guaranteed” to succeed; it’s worthy of earning experience.\r\n\r\nBut before we get into the exact details of the ‘how’; lets start of with the ‘when’\r\n\r\n## When? Scenes & Ventures\r\nThe primary time to hand out experience will be at the end of any given Scene or Venture. \r\n\r\n### Scene\r\nA Scene is a narrative tool of semi-indeterminate length within a certain context, which can consist of one or multiple Situations. An example of a Scene would be: “Traveling from Pewter City to Mt. Moon”. It’s a situation that likely will take many in-game hours, but it is likely unnecessary to actually spend many play-hours in the scene itself.\r\n\r\nAlong the road to Mt Moon your players may encounter some wild Pokemon, as well as help a lost kid find their way to the Pokemon Center, these Situations can be played out in many ways; the wild pokemon encounter may have started off as a Social situation during [Exploration Activities](/rules/exploration) but ended up turning into a [Combat Situation](/rules/combat) after the players repeatedly failed their [Skill Checks](/rules/skills) to befriend the wild pokemon. Meanwhile the players probably had to use their <Skills\\> such as [[Tracking]](/traits/tracking) to find the girl, perhaps she was stuck in a cave whose entrance caved in requiring more Skill Checks to complete this Exploration Situation. \r\n\r\nAt the end the players reach the Pokemon Center and completed the “Travel to Mt. Moon” scene. Surely that deserves some experience!\r\n\r\n### Venture\r\nMeanwhile this scene was but a part of their overall Venture and goal, which is to: “Get to Cerulean City and beat Misty; the Cerulean City Gym Leader!”\r\n\r\nA Venture is a narrative tool similar to the Scene; but is different in a few distinct ways. \r\nFirstly a Venture is often associated with a goal that will likely take many IRL Play Sessions or at the very least a good few hours of session time to resolve. \r\nSecondly, a Venture should always move the narrative forward; this doesn’t mean you need to railroad your players of course, your players deciding they want to spend some time at the Game Corner grinding up the required coins for a Dratini is just as valid of a Venture even if it doesn’t move the plot forward in the way you the GM envisioned... But the players are still narratively moving forward!\r\n\r\nIn a way, Ventures can be seen as a natural point for people who are used to running Milestone leveling, after all usually a Venture is only finished once some major goal has been concluded, be it successfully or not!\r\n\r\n## Experience Timings\r\nGMs are free to choose whether they prefer handing out Experience during Scenes or Ventures; or even both!\r\n\r\n### Exclusively Scenes\r\nWhen handing out experience exclusively in Scenes, you can follow the guidelines listed below to award experience as normal.\r\n\r\n### Exclusively Ventures\r\nWhen handing out experience exclusively in Ventures, keep track of the amount of Scenes your players resolve and how they do; the base experience value will be equal to the regular base value for a Scene times the amount of Scenes your players have resolved. All Circumstance Modifiers will be added up together at the end.\r\n\r\n### Combination of Both\r\nPossibly the most natural way to hand out experience is the combination of both; you hand out experience at the end of a Scene like normal. However, whenever a Scene would result in concluding a Venture you add an additional positive Circumstance Bonus for having finished the Venture.\r\n\r\n## Calculating Experience\r\nExperience rewards rely on 2 key variables: The Base EXP Reward (BER) and the Circumstance Modifiers (CMs).\r\n\r\n**Base EXP Reward (BER):** This value is at 25% of the amount of XP needed to level up from the average player level, rounded up. \r\n  This value is 25% of the amount needed to go from the current average player level, to the next on the 'Slow' track, unless playing an exclusively Pokemon PC game, where you would use the 'Faster' track instead.  So f.e. At level 1 following the 'Slow' track, the BR is 2 XP, 253 XP at level 20, 1531 XP at level 50 and 3889 XP at level 80.\r\n\r\n**Circumstance Modifiers (CMs):** Circumstance Modifiers are modifiers to total exp earned for an encounter and are based on how players resolve Situations and how well they do so. The more ingenuitive the Player; and the better their results, the higher their CMs will be. However, did a plan fall through and end up in the gutter? It could result in some penalties to your total EXP earned… CMs are all cumulative stacked on-top of each other, meaning if you get a 10% bonus twice, the total bonus becomes 20%. You do not apply BER * 1.1 * 1.1.\r\n\r\nThe effort of all the players should be combined together in one reward; meaning that whenever you award Experience you should apply the same amount to all Player’s their [Trainer] Characters, as well as up to 6* of their Pokemon\r\n> *Alter this number based on the party size you enforce in your campaign. Consider allowing players to award Experience to Pokemon in their box.*\r\n{.is-info}\r\n\r\n## What awards Experience?\r\nSo as I referenced a little earlier; realistically any type of situation can result in earning experience, listed below is a list of CMs a GM can choose to add to any given Scene or Venture to award or penalize the total EXP earned by the Party. Realistically there is no limit to how many modifiers you should give; just remember that if the modifier reaches 5 or higher that means your player’s their characters are guaranteed to get a Level-Up! \r\nCircumstance Modifiers\r\nThe following sections depict all kinds of situations you may want to award experience; for your ease of use they’ve been separated in the following categories:\r\n- Combat\r\n- Social\r\n- Exploration\r\n- Contests\r\n- Pokeathlons\r\n\r\nThis doesn’t mean you should limit yourself to only awarding experience when these 5 types of scenarios occur; feel free to use the framework provided to create unique modifiers that make sense for the encounters ahead! Some examples of this will be provided below as well.\r\nThese following samples are also built with a “Standard Pokemon Journey” kept in mind; so it may refer to things like ‘Evil teams’. Of course, in a Journey where you’re playing as Evil Team members… you’d just have to invert the criteria.\r\n\r\n### Early Bonus\r\n- **Babies First Steps**: +100%\r\n  - If the Average Level that the Base EXP Reward was calculated from is less then 10, apply this bonus. It is here to help out while you're in those lone digits!\r\n\r\n### Combat\r\n- **Major NPC Defeated** +200%\r\n\t- Such as a Gym Leader, Team Rocket Lieutenant or Rival. Feel free to increase this reward for higher-stakes fights with bosses such as Legendaries, or Elite Four members, or even Giovanni himself!\r\n- **Won Encounter** +50%\r\n- **Thwarted Evil Plans** +40%\r\n\t- Think defeating a Pokemon that was terrorizing an area after Team Rocket pissed it off by attacking its young!\r\n\t- Or if you are the evil doers… thwarting the Forces of Good can be just as enticing…\r\n- **Impressive Usage of Strategy** +40%\r\n\t- This can be anything like the Players using the terrain to their advantage; to impressive teamwork or even just quick thinking on the spot! Award your players for their ingenuity! \r\n\t- Some more examples:\r\n\t\t- Defeating the Kangaskhan by having Scorbunny run around its legs with rope to take it down like an AT-AT\r\n\t\t- Destroy the nearby Water Tower to make everyone Wet and in for a Shocking Surprise.\r\n\t\t- The Stealth Rocks that Skarmory put up made it so that the Charizard couldn’t charge in against it and instead force it to come in close and fight the Seismitoad ready to fight in close-quarters with this Lizard!\r\n\t\t- You managed to allow the entire party to benefit from your Sandstorm strategy; yet they barely even have any Ground, Steel or Rock types!\r\n- **Impressing (Major)** NPCs +20%\r\n\t- You may not have beaten the Elite Four member with your 3 gym badges… But they’re impressed by how good you already are! \r\n\t- You can consider not giving the “Lost Encounter” penalty when awarding this bonus.\r\n- **Entertain the Crowd** +20%\r\n\t- You really know how to give a show! The NPCs watching your fight be it Humans or Pokemon really loved watching that, or are happy and thankful you resolved the situation before it could further get out of hand.\r\n- **Ally Saved** +10%\r\n\t- You managed to save an ally; be it by reducing the damage they would receive by lowering it; making an attack miss; taking the hit yourself, or plainly removing the source of damage! Teamwork is the dreamwork!\r\n- **Capture a new Species** +10%\r\n- **Fled Encounter** +0%\r\n\t- Running away is always a valid option!\r\n- **Destroyed Public Infrastructure** -15%\r\n\t- You better have a good explanation for Officer Jenny…\r\n\t- Don’t award this penalty if players received permission.\r\n- **Lost Encounter** -30%\r\n\t- Even the protagonist loses sometimes…\r\n- **Gruesome; Half the party or more fainted!** -30%\r\n\t- Yikes. You may have bitten off a bit more than you can comfortably chew…\r\n- **Party Defeat** -50%\r\n\t- There certainly is experience to be gained in this manner… but not the type you were hoping for…\r\n\r\n### Social\r\n- **Major Influencer** +100%\r\n\t- This social encounter involves someone or something key to the plot of this Journey, it’s impressive you managed to survive!\r\n- **Avoided a Fight** +50%\r\n\t- Wow that was gonna be scary, glad you talked your way out of it!\r\n\t- Only award this if the Fight was going to be challenging; talking down an angry Caterpie with your Charizard ain’t gonna award you additional EXP.\r\n- **Convincing Story** +30%\r\n\t- Who knows you could convince someone like that! You managed to convince someone of a fact that wasn’t… quite true, but surely it will help you achieve your goal!\r\n- **Very Persuasive** +30%\r\n\t- Sway someone to do something they didn’t originally plan to do; or didn’t agree with before, to now help you out / agree with!\r\n- **What an Argument!** +30%\r\n\t- You just made the GM stutter with how ingenious your argument was, awesome work.\r\n- **Awesome Roleplay** +30%\r\n\t- That was super in-character, absolutely love it!\r\n- **Made the Table Laugh** +30%\r\n\t- We’re playing games for fun right? Sometimes a Dad joke is appropriate after all… \r\n- **Quick Witted** +30%\r\n\t- You handled that situation with ease despite being unprepared, or perhaps your information was incorrect? Either way, you did a great job!\r\n- **Capture a new Species** +10%\r\n- **Offended the NPC** -20%\r\n\t- You were trying to befriend them… not offend them…\r\n- **Minor Scenario** -50%\r\n\t- Some things are just too minor to really give you the experience you expect from your journey.\r\n\r\n### Exploration\r\n- **Find what you’re looking for** +30%\r\n- **Nice Meal, Cozy Fire, a successful Camp!** +30%\r\n\t- Succeed at more than half of your Camping Checks (min 1.)\r\n- **Clear the blocked path** +30%\r\n- **Solve a Puzzle** +30%\r\n- **Participate in a Skill Challenge** +30%\r\n\t- Whether you succeed or lost; you helped move the plot forward! Succeed at a skill challenge set-up by the GM.\r\n- **Capture a new Species** +10%\r\n\r\n### Contests\r\n- **Place First Overall** +100%\r\n- **Place Second Overall** +50%\r\n- **Place Third Overall** +25%\r\n- **End first in the Introduction / Visual Phase** +20%\r\n- **Trick Your Opponent** +20%\r\n\t- Make your opponent Fumble through the usage of a cleverly timed move\r\n- **Top Performer** +20%\r\n\t- Score the highest amount of appeal in any round of the ‘Secondary Judging’ better known as the ‘Moves Evaluation’\r\n- **Get Fourth Place or Worse Overall** -10%\r\n\r\n### Pokeathlons\r\n- **Place First Overall** +100%\r\n- **Place Second Overall** +50%\r\n- **Place Third Overall** +25%\r\n- **Place First in a section of a Triathlon** +20%\r\n- **Succeed against all odds** +20%\r\n\t- Succeed on a Skill Check in which you have less than 20 points invested!\r\n- **Get Fourth Place or Worse Overall** -10%\r\n\r\n## Awarding the Appropriate Amount\r\nThe above should give you a good idea for what types of Circumstance Modifiers can be included when awarding experience; you can use as many or as little of them as you want and heck; may even consider giving the same one multiple times when applicable!\r\n\r\nAt the end of the day this is a framework that allows you to award experience appropriately; to properly balance your Journey you’ll want to consider the length of said Journey, at the end of the day from a progression perspective the goal will be to reach Level 100. So given the example of a bog standard “Beat the Gym Campaign” you probably want every venture to provide about 8-10 levels worth of experience, one for each Gym, perhaps one for teaching the local evil team a lesson, defeat the E4, and finally of course, win the championship!\r\n\r\n## Custom Modifier Example\r\nOne of your trainers is really focused on learning more about Fossils and using Fossil Pokemon; so you introduce a new Exploration Circumstance Modifier for “Finding Fossils in hard-to-find locations” worth +30%. Additionally, one of your trainers has been following a creative nicknaming convention for all their mons, whenever someone picks a creative, fun and or fitting nickname for a Pokemon upon capture: +20%.\r\n  \r\n## EXP Math for Nerds\r\nThe EXP tracks we use are based on the video game ones, using the 'Slow' track for Trainers, and we have created our own 'Faster' track to use for Pokemon.\r\n  \r\nThis means that mathematically we can identify the experience curve as follows, where n == level\r\n#### Trainers\r\n$$\r\nEXP = \\frac{(5n^3)}{4}\r\n$$\r\n\r\n#### Pokemon\r\n$$\r\nEXP = \\frac{(3n^3)}{6}\r\n$$","format":2}},{"name":"exploration","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Exploration\r\ndescription:  One! Don't shirk work! Two! Run away and pay! Three! Smiles go for miles!\r\npublished: true\r\ndate: 2024-06-12T11:32:23.257Z\r\ntags: exploration\r\neditor: markdown\r\ndateCreated: 2024-05-10T14:05:15.510Z\r\n---\r\n\r\n# Exploration\r\n\r\nExploration is the descriptor we apply to everything that does not fall within the confines of Combat, or Downtime, though there are certainly some overlaps between Exploration and Downtime.\r\n\r\nWe present some Exploration Actions, as prompts for your interactions with the world around you, but these are not exhaustive and are intended mostly as guidelines for providing structure to your gameplay, rather than a strict process.\r\n\r\nExploration actions are highly context sensitive, in that an exploration of a Mystery Dungeon will look very different to trainers traversing a well-known route, or a Pokemon Concierge heading into town to buy supplies for their clients or even a Pokemon Detective headed out into the streets to try uncovering crime.\r\n\r\nThese actions are commonly resolved through forms of skill challenges - either specific stipulated ones that the GM has pre-planned, or impromptu ones from the players seeking interesting ways to resolve an obstacle.\r\n\r\nBeyond that, another key element of Exploration is the Exposure mechanic, which represents the inherent dangers of more extreme environments.\r\n\r\n## Example Exploration Actions\r\n\r\n### Cartography\r\n\r\nCartography is the act of mapping out the lands you travel. Making Navigation rolls appropriate to the environment, you can spend time (typically in the form of spans of the day clock) to familiarise yourself with the environment and potentially gain bonuses on future exploration actions there.\r\n\r\nIn the case of a Mystery Dungeon, Cartography may be unhelpful as these strange domains rearrange themselves whenever Pokemon enter them.\r\n\r\n### Search for Pokemon\r\n\r\nWith this exploration action, you may roll a Track skill check to hunt for a Pokemon that may be found in the environment. Failure on this check may still result in you locating Pokemon as you hoped, but most likely not in the advantageous circumstances you might have hoped for (such as the Luxray now stalking you, rather than you stalking the Luxray.)\r\n\r\nThe difficulty of the Track check should be modified in accordance with how rare the creature you've chosen to look for is in the environment, and GMs may wish to further modify this based on other factors they believe appropriate.\r\n\r\nNaturally, this cannot find Pokemon that do not live in the environment you have chosen to search. Fishing is a specialised example of this action.\r\n\r\n### Fishing\r\n\r\nWhilst the steps that come after tracking a Pokemon that resides in the air or on the land are a bit more nebulous, fishing is a bit more structured. After using the Track skill (or Survival may also be used in the example of Fishing), the next phase becomes a Racing Clock, wherein you and the opposing aquatic pokemon must roll against one another to try and fill your clocks first - you via the use of the Lift skill, and the Pokemon via the use of the Swimming skill.\r\n\r\n### Gather Resources\r\n\r\nThe Gather Resources action can morph depending on what resource you're seeking, and the perks you have at your disposal. Typically, however, it takes the form of either a Natural World skill check, or a Survival check. Which is more fitting depends on what you are trying to search for - Natural World or even a Science (Geology) roll might fit best for Tumblestone, whereas Survival or Natural World fit better to forage for berries or edible mushrooms.\r\n\r\nA specialised example of the Gather Resources action might be a \"Fossil Dig\" action, which would very specifically require a Science (Palaeontology) roll.\r\n\r\n## Exposure\r\n\r\nExposure is a highly situational mechanic but it's function is consistent regardless of it's cause.\r\n\r\nA creature becomes Exposed due to extremes of it's environment or situation that will lead to harm if allowed to continue for longer. For example, a Pokemon that is poorly adapted to an arctic environment will begin to suffer from Cold Exposure if the GM deems it has been long enough in the harsh environment. This Exposed affliction persists until the cause of the exposure is considered to have been escaped from.\r\n\r\nSo what does Exposure do?\r\n\r\nInitially, Exposure prevents you from recovering stacks of Weary. On it's own, this is not too dangerous but it does make recovering from combats in that environment more difficult to do. If it persists for long enough (that length determined as appropriate by the GM and dependent on the severity of conditions), it would be appropriate to begin a Clock, counting down to when the Exposure begins to worsen. Once this clock fills, inflict another stack of Weary on the creature, and begin a new clock for the next stack of Weary.\r\n\r\nAside from the crippling nature of the Weary condition, GMs may wish to decide that if Weary stacks climb as high as 5 due to Exposure, that the extreme environment has led the creature to perish. Consider if this mechanic is appropriate to your own campaign world.\r\n\r\n### Drowning\r\n\r\nDrowning is ultimately a specific form of Exposure that should have a significantly shorter activation time and clock to tick toward. Weary stacks should accrue quickly once a creature enters the Drowning state. Playtesting should reveal the optimal timespan for Drowning, we can't reasonably say at this time.","format":2}},{"name":"gear","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Gear, Shopping and Crafting\r\ndescription: \r\npublished: true\r\ndate: 2024-06-12T11:32:45.198Z\r\ntags: rules, gear, economy, crafting\r\neditor: markdown\r\ndateCreated: 2024-05-18T17:31:35.463Z\r\n---\r\n\r\n# Gear - Items and “Gearing Up”\r\n\r\nIn PTR:2E, items are simply called Gear and are expanded to cover any type of item imaginable. This includes not just the regular items from the video games, but also covers weapons and armor. Wherever Gear is mentioned, this means that any rules for Gear and Gearing up applies in all cases.\r\n\r\n## Gear Categories\r\n\r\nAll Gear is separated into the following Equip categories:\r\n\r\n-   Held Items - Gear held in one or more hands, or appendages able to hold an item like a hand would. Weapons and some battle items fall under this category.\r\n-   Worn Items - Gear that is worn over the body. Armor and some battle items fall under this category.\r\n-   Accessory Items - Gear that can be attached to an area of the body, or in some cases, attached to other Gear (see Utility Jumpsuit for an example). Most battle items for Pokemon and some Trainer items fall under this category.\r\n-   Belt Items - Gear that is equipped in the Belt Item Slot. Consumables such as Restoratives, PokeBalls and Food items fall under this category. Belt items equipped to the Belt Item Slot can have an amount equal to the items \\[Stack X\\] value in the same slot if applicable.\r\n\r\nFor Crafting (see below) and general organization, gear is further separated into the following Item categories\r\n\r\n-   PokeBall - your reliable Pokemon capture device\r\n-   Weapon - Gear that is used for direct fighting. These items can have their own \\[Struggle\\] or \\[Fling\\] stats, as well as give access to an array of Weapon Attacks and other Typed Attacks depending on the item. Weapons can also have their own “PP Stock”, which can only be spent on the Moves the weapon gives access to, functioning like ammunition.\r\n-   Equipment - Armor and Accessories fall under this category. Like Weapons, these can also give access to moves, and also can have a PP Stock to use those moves.\r\n-   Restorative - Potions, Status cures and general medicine items.\r\n-   Booster - X Items and Type boosters. These provide temporary or passive bonuses to various stats.\r\n-   Food - Berries and meals. These items have a variety of effects but mainly aid in recovering from Weary.\r\n-   Evolution Item - Stones and Keepsakes. Mostly Rare quality items that aid in evolving Pokemon.\r\n-   Ammo - \\[Fling\\] items that can be thrown or used by a Weapon. Can have a variety of effects besides causing direct damage.\r\n-   Container - Backpacks, bags, pouches. These items allow you to carry your gear without any hassle. Optionally, container items can have limited storage space (like PMD).\r\n-   Material - Mostly useless collections of material, like food scraps or metal slag, but notably may be used for the crafting of other items. See the “Collecting Materials” section for more details.\r\n-   Other - Everything else. Usually involves items that have no direct battle application, but make up for it through utility.\r\n\r\n## Gearing Up - Equipment Use and Actions\r\n\r\nGearing up is a simple way to explain equipping items. Across an adventure, knowing what items to keep directly on your person and easily accessible can mean the difference between success and failure. Every creature gets a limited number of equipment slots, and each piece of Gear can only be equipped to its respective slot.\r\n\r\n-   Human creatures get 1 Held Item Slot, 1 Worn Item Slot, 1 Accessory Item Slot, and 3 Belt Item Slots.\r\n-   Other species get 1 Worn Item Slot, 1 Accessory Item Slot and 1 Belt Item Slot.\r\n-   The main Player Characters (PC) have 1 Backpack Slot to equip container items.\r\n\r\nThe number of equipment slots a creature has can be altered by traits, abilities, perks and sometimes other items.\r\n\r\n### Gear Equipping Rules\r\n\r\n-   Only 1 of each type of gear can be equipped to their appropriate slot. In the case of Belt Slot items, they can be equipped up to that items \\[Stack\\] value in a single slot.\r\n-   If a piece of Gear has more than one Slot listed, then it uses all of the listed slots. These items tend to have a combination of effects or give a larger bonus for taking up multiple slots.\r\n-   Container items are special in that having multiple container items does not take up additional equipment slot space in most cases. Container items simply add additional storage space without penalties, unless otherwise stated in the item’s traits or effect.\r\n\r\n### Gear Actions\r\n\r\nNow that you’re geared up, how do you use items? Below are the following actions that allow you to use your items and generally interact with the world around you.\r\n\r\n#### Use - *Simple Action*\r\n\r\nYou may activate 1 item you have on your person or within \\[Reach\\] that you have access to. The Use action changes depending on the item’s effect or location:\r\n\r\n-   If the item is equipped to your Belt Slot, you can retrieve and use the item with 1 Simple Action.\r\n-   If the item is currently stored in a container, the Use action requires 1 Simple action to open the container, and 1 Simple Action to retrieve and use the item.\r\n\r\nThe Use action will make up a majority of actions for interacting and using items. This isn't limited to items alone and applies to objects in the environment as well, such as doors, buttons, levers, etc. Basically, if you have to manipulate something manually, it will require a Use action. In a combat scenario, you won't necessarily be able to use an item and attack on the same turn, and the Use action helps make this an easy distinction.\r\n\r\nAlong with this, creatures that have an item used on them, like a Potion, doesn't cost their activations like in the video games. Only the user spends the action cost.\r\n\r\n#### Draw/Store - *Simple Action*\r\n\r\nYou equip 1 Held item you have on your person or within \\[Reach\\] that you have access to, or store an equipped Held item in your Container or another slot if applicable. At the start of combat you can use this action as a Free Action as long as you are not Flinched / \\[Surprised\\].\r\n\r\n#### Drop - *Free Action*\r\n\r\nYou drop your currently equipped Held item on the space you are standing on. This frees up your Held Item Slot.\r\n\r\n# The Economy\r\n\r\nPTR:2e uses cashless economy rules. This means that instead of direct cash rewards, character wealth is determined by Inventory Points (IP) and the **Resources Skill**. These represent a character’s ability to acquire goods and utilize services in a campaign.\r\n\r\n## Inventory Points (IP)\r\n\r\n**Inventory Points** or **IP**, is a meta-resource characters have to purchase items. The amount of IP a character has is determined by their Resources Skill with the following formula:\r\n\r\nIP\\=12+⌊ResourcesSkill÷10⌋IP = 12 + \\\\lfloor ResourcesSkill\\\\div10 \\\\rfloor IP\\=12+⌊ResourcesSkill÷10⌋\r\n\r\nIP is used in a couple of ways. The first is used to set a character's **Loadout**. When creating a Loadout, **Common Rarity** \\[Consumable\\] and \\[Charge\\] items are selected up to the character’s current **Grade**, subtracting IP equal to the IP cost of the items. IP costs for items with the \\[Stack X\\] trait are for a single item in the stack. So if a character selects a stack of Potions, the total is 6 IP (2 per Potion).\r\n\r\n> For reference, a character’s Grade increases at the following levels  \r\n> Level 1 -> Grade E  \r\n> Level 15 -> Rank up to Grade D  \r\n> Level 25 -> Rank up to Grade C  \r\n> Level 35 -> Rank up to Grade B  \r\n> Level 45 -> Rank up to Grade A\r\n\r\nThe second thing IP is used for is to gain an item at a moment that it is needed, but the actor does not currently possess, utilizing the Use action as a Complete Action as if they are drawing the item from their container. Any character that has any remaining IP can perform this action in this way so long as they can justify why they would gain this item in the moment. **Note: an item gained in this way during combat must be used within the same action, or else the item is never acquired.**\r\n\r\nAny items used from a Loadout will refund its IP cost during a **Resupply Activity**. This allows characters to top off or refresh any of their loadout items, or allow them to make changes in case of a change in IP totals. Characters can also choose to “sell” the items in their Loadout, resturning the IP back to their pool to spend on replacement/different items if they so desire. Any remaining IP not used by items from the Loadout is also refreshed during this activity. Resupply Activities can be done whenever the Players enter a settlement or zone that has markets or shops.\r\n\r\n## Item Availability and Shopping\r\n\r\nItems in the game use the following to determine availability: Grade and Rarity.\r\n\r\n**Grade** refers to an item’s quality. The Item Grades are **E, D, C, B, A, S, and S+**, where E is the lowest quality, and S+ for the highest. Grade is not necessarily a measure of how strong an item is or how expensive it can be. Rather, it’s more abstract to denote the “cumulative value and significance” of an item beyond merely monetary value.\r\n\r\nMechanically, Grade is intended to work as a scale of how easily a creature can gain the item and use it. This depends on your specific campaign setting, as the obtainability of higher grades could be tied to having more Badges in a traditional Gym Challenge or a higher Exploration Rank in a Mystery Dungeon game.\r\n\r\n**Rarity** is the measure of general availability of an item. Item rarities are: **Common, Uncommon, Rare, and Unique**. Commonly, higher Grade items are often higher Rarity in many traditional settings. But Rare or Unique items that are higher-tech or magical in a normal setting would probably be Common or Uncommon in cyberpunk or high fantasy settings.\r\n\r\nOn a basic level, Grade and Rarity is used to determine the stock of shops in settlements, or loot in dungeons. The listed, out-of-the-box values for these items are considered the “defaults” for the most common Pokemon settings: that of the mainline video games. Because of this, an Item’s Grade and Rarity, more than any of their other stats, are the two values we recommend GMs look into revising to fit for their own setting.\r\n\r\n### Shopping Activity\r\n\r\nShopping is an Extended Downtime Action that takes one Daytime Span to complete. When in a place that has shops, share with your players the number and types of shops available. During this span, players can shop at one or all locations provided to them.  \r\nWhenever anyone in the party wishes to participate in the Shopping Activity, the party rolls a Resources Skill Check for each item they wish to obtain, using a DC modified by the Item Grade and Rarity, and the Resource Skill of the player of their choice. Players can roll for any Items within reason. Refer to the following modifiers to determine difficulty of the roll:\r\n\r\n-   Players rolling for an item above their Grade have a -10 penalty to the DC per higher Grade on their roll. If the DC falls to 0 the item cannot be rolled for.\r\n-   Players rolling for an item below their Grade get a +10 bonus to the DC. If the DC is 100 or more, the player has +1 degree of success on the roll.\r\n-   Item rarity affects the roll using the following  \r\n    \\- Common +40  \r\n    \\- Uncommon +0  \r\n    \\- Rare -20  \r\n    \\- Unique -40\r\n-   Similar to normal Skill Rolls, players (not just the one whose Resources Skill is being used to roll) may spend Luck to increase the result of their roll, or choose to spend Resources to do the same.\r\n\r\nOn a success, the player gains the item in question as they are able to afford it and it is available. For items with a \\[Stack X\\] value, players gain 1 of the item per Degree of Success, up to a maximum amount of X.\r\n\r\nOn a failure, the player does not gain the item, and cannot roll again for that item until the next time the shop Restocks.\r\n\r\nAs an example, let's say that a level 1 player with a Resources skill of 40 wants to have more basic balls than their Loadout provides. They are in a settlement with a trainer supply shop. They spend time performing a shopping activity, rolling a d100 against a DC 80 check (40 Resources Skill + 0 Item Grade mod + 40 Item Rarity mod). They roll a 60. Because they rolled with +2 Degrees of Success, they gained 3 stacks of basic balls instead of 1, with the reasoning that they were on sale so they could afford more. While they are there, they also try for Great Balls, which is 2 grades above their rank. They roll a d100 against a DC 60 (40 Skill - 20 grade penalty + 40 Item Rarity) and roll a 65. They unfortunately were unable to obtain the item, with the reasoning that they didn't have enough after buying the Basic Balls.\r\n\r\nWhile the Shopping Activity is the easiest way for your players to get items they want, it is not without limitations. Shops need to Restock items periodically and rotate their inventory. Because of this, the Shopping Activity is limited to 1 use per Settlement and recharges after the settlement Restocks, usually taking 1 in game week or when circumstances change according to the GM.\r\n\r\n> GM Note: Players can realistically roll for every single item in the game at the right shops. While there is no specific rule to prevent that, it is a good idea to limit these rolls as needed. Also feel free to tell them no if they even attempt that.\r\n\r\n### Increasing Resource Skill\r\n\r\nThe Resource skill is vital to a player’s ability to gain items and favors. The first way the Resource Skill can be manipulated is by winning battles and completing Quests (just going with this for now until we decide progression stuff). For each of the following factors, the players gain a permanent increase to their Resource Skill:\r\n\r\n-   Winning a Battle vs other Trainers (or Exploration Teams) +1\r\n-   Defeating a Rich opponent +3\r\n-   Defeating a Boss +5\r\n-   Completing a Quest +1-5\r\n\r\nHowever, failing the above factors will result in a permanent decrease to the players Resource skill. The Resource skill cannot be increased above 90 or decreased below 10.\r\n\r\nThe second way to manipulate the resource skill is by using Treasure items, such as the Nugget. Treasure items are consumables that give a one time bonus to any Resource skill roll. Each treasure item lists the bonus it grants.\r\n\r\n# Crafting and Other Acquisition Means\r\n\r\nCrafting is another way for players to obtain items. When crafting items, the players will need the following:\r\n\r\n-   The correct amount of materials.\r\n-   The recipe of the item they wish to craft.\r\n-   The right tools on hand.\r\n-   Enough time to complete a crafting project.\r\n\r\n## Collecting Materials\r\n\r\nThe first thing a crafter needs to get familiar with is the materials to craft items. Materials are separated into two categories: Generic Materials and Specific Materials.\r\n\r\nGeneric Materials are as the name implies: these are highly abundant crafting resources that are commonly used across items in a single category. Generic materials can be identified on the item list under Materials as they all have a \\[Stack X\\] value. When used in crafting, a higher number of these items is needed the higher the Grade the item is. (We’ll need to determine how we want to handle the Generic Materials. It may be best to have Generic Materials for every Item type. We’ll probably tie that to a Trait, and have the value in the Category column also be read as a separate Trait.)\r\n\r\nSpecific Materials are a bit of the opposite. Unlike Generic Materials, these do not have a \\[Stack X\\] value and can only be acquired if they are readily available around where the players are. Specific Materials are also on roll tables, such as the Apricorn table as an example.\r\n\r\nFor players to find crafting materials, they can perform a Gather Material Activity\r\n\r\nGather Materials - 1 Camp Activity  \r\nThe players roll an appropriate skill, or their Resource skill, to locate crafting materials in the area they are in, or an area that is close by. When rolling, they declare the item they are looking for materials to craft and apply the following modifiers:\r\n\r\n-   Listed materials are in the area +10\r\n-   Listed materials may be in the area -20\r\n-   Listed materials are not supposed to be in the area -40\r\n-   Material Item Rarity Modifiers  \r\n    \\- Common +40  \r\n    \\- Uncommon +0  \r\n    \\- Rare -20  \r\n    \\- Unique -40\r\n\r\nOn a success, the players gain 1 Stack of the Generic Material and 1 of the Specific Material. For every degree of success they players have, they gain 1 more of both the Generic and Specific Material. Rolls with a DC of 100 always have +1 degree of success, and rolls at 0 DC cannot be attempted.\r\n\r\n## Item Recipes\r\n\r\nThe second piece for crafting is a **Recipe**. Recipes are items that are not typically found in shops. These usually need to be acquired from someone that knows the recipe, or found through other means such as from a **Crafting Manual**. During a Shopping Activity, a player can inquire if there is a teacher or another location that may have recipes to learn on hand. If there is, they roll the Crafting Skill listed on the recipe using the same modifiers for recipe Grade and Rarity as if they were Shopping, and may use Resources and Luck as with Shopping. **As a rule, Recipes are always 2 Grades and 1 Rarity higher than the item they are associated with**.\r\n\r\nOn a success, the player gains and learns the recipe, adding it to their own Crafting Manual. For recipes found as loot, a player can spend 1 Downtime Activity to add the recipe to their manual by succeeding on an Hard Skill Check with the listed Crafting Skill.\r\n\r\n## Crafting Projects\r\n\r\nNow that a player knows the correct recipe and has the correct number of materials, they can attempt to craft the item. Crafting is a time consuming process that needs total focus to complete.\r\n\r\nWhen a player wishes to begin crafting, determine first if they are in an area that allows them time to craft. To determine this, find the items Project Clock amount. It takes 1 use of the Craft Activity to fill in 1 Span of the Progress Clock.\r\n\r\nIf the player has enough time, next determine if they have access to the correct tools for crafting the item. Shops and PokeCenters can have crafting stations for your players to use. Otherwise, they will need the correct Tool item in their inventory, such as the PokeBall Maintenance kit.\r\n\r\nFinally, determine if the player has the correct amount of materials to craft at least 1 of the desired item. If all of these criteria are met, the player then performs a Craft Activity.\r\n\r\n### Craft Activity - Camp Activity\r\n\r\nChoose an item you desire to craft and roll the listed crafting Skill using the following modifiers:\r\n\r\n-   Using a crafting station or tools you do not own -10\r\n-   Working in a quiet area +10\r\n-   \\-10 for each Item Grade above your own Grade\r\n-   +10 for each Item Grade below your own Grade\r\n-   Item Rarity Modifier\r\n    -   Common +40\r\n    -   Uncommon +0\r\n    -   Rare -20\r\n    -   Unique -40\r\n\r\nOn a success, you fill in 1 Span of the item’s Project Clock. If the Project Clock is filled, you spend the listed materials to craft 1 or more of the desired item. In this case, you may spend Resources equ. You must still spend materials to craft 1 of the item.\r\n\r\nFor each degree of failure, the Project Clock is increased by 1 due to a setback, and finishing the item will take additional uses if the Craft Activity to complete. You do not roll further crafting checks for the same project clock.","format":2}},{"name":"gm-tips","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: GM Tips and Suggestions\r\ndescription: Advice, Optional Tools and Mechanics, and more!\r\npublished: true\r\ndate: 2024-06-12T11:32:30.223Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-05-24T12:36:02.956Z\r\n---\r\n\r\n# Interludes\r\n\r\nAn **Interlude** is a simple, optional tool that a GM can use to facilitate Downtime Actions over long spans of time where the plot of a campaign is less relevant. Essentially, Interludes are low stakes time-skips that are used to jump the players to the next major scenario in a story, either spatially or chronologically, allowing them to complete Downtime Actions over the quiet, uncomplicated time in the interim between significant story arcs of a campaign.\r\n\r\nWhen deciding if you want to use an Interlude, make sure you have an **End Trigger** in mind that determines when to resume standard play. An Interlude could be the training arc before a party tackles a large regional tournament, with its End Trigger being the moment the players arrive at the tournament grounds. Or perhaps the players are assisting a village preparing for the typhoon season in a Mystery Dungeon campaign, where the End Trigger is the first moment the sentries notice the season’s first typhoon's clouds on the horizon.\r\n\r\nWe are presenting two approaches that may be used: **Relaxed** and **Preparatory Interludes**. Relaxed Interludes are a bit more general and well… relaxed, while Preparatory Interludes are intended to be used when GMs need to exert more control over the long timeframe.\r\n\r\n**Relaxed Interludes** are formed by an explicit verbal agreement between the players and GM, and generally best used for soft End Triggers that the party is malleable enough in meeting (such as making the trek to another Region).\r\n\r\nThe GM states roughly how long the Interlude will be, what restrictions and conditions it may have. Then, the players suggest Downtime Actions (either in-progress or new) to complete during the timeframe set by the GM. When all parties agree to the Downtime Actions to complete, the Clocks for those Actions are completed, the players receive the associated rewards, and the GM progresses time to the agreed upon point to continue the story of the campaign.\r\n\r\n**Preparatory Interludes** work similar to the Relaxed Interludes, with the GM stating roughly how long the Interlude will be, what restrictions and conditions it may have. Then, they instate an Interlude Clock based on these factors (formula to come later?). The **Interlude Clock** is present to account for more tense situations, where a decent amount of time needs to pass but the End Trigger is specific and immovable (such as the above tournament and flood examples).\r\n\r\nEach Span on the Interlude Clock corresponds to one Downtime Actions. Depending on the various circumstances surrounding the Interlude, the GM may opt for requiring Skill Rolls for some of these Actions rather than making them automatically complete.","format":2}},{"name":"regional-phenomena","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Regional Phenomena\r\ndescription: Mega Evolution, Z-Moves, Dynamax, Terastalization, Shadow 'Mons, and more!\r\npublished: true\r\ndate: 2024-06-12T11:32:54.995Z\r\ntags: [phenomenon], phenomenon, phenomena, mega, mega evolution, dyna, dynamax, tera, terastal, z-move, z move, shadow, shadow pokemon, delta, delta species, nuclear type, nuclear\r\neditor: markdown\r\ndateCreated: 2024-06-10T15:36:55.297Z\r\n---\r\n\r\nWhile each region in the mainline Pokémon games has their own unique quirks and mechanics, Generation 6 introduced Mega Evolution, which proved to be the first of the trend of GameFreak introducing a new overarching mechanic each generation from then onwards. Because of the tendency to introduce them one generation and deemphasize or remove them in the next, it’s more prudent to call these mechanics, collectively, “Regional Phenomena”, or just **Phenomena** for short. _Things related to these Phenomena will possess the \\[Phenomenon\\] Trait_.\r\n\r\nFor the purposes of allowing flexibility and options for all campaigns and groups, we are choosing to include specific rules for the Phenomena observed in the mainline series, with the door open to explore those introduced in side games or fan-made games later on.\r\n\r\nHowever, because they are “regional”, _it is advised that GMs use their discretion in making these mechanics available to their campaign_. The introduction of many of these items can heavily sway the power and narrative balance of a campaign, especially since all of them are narratively powerful in their source materials and, for the most part. The flavor provided for these mechanics are a guideline, but not a hard and fast ruleset.\r\n\r\nFor the purposes of Pokémon Tabletop Evolved, the Phenomena we support as core are as follows:\r\n\r\n-   _Mega Evolution_ (first introduced in *Pokémon X* and *Pokémon Y*)\r\n-   _Z-Moves_ (first introduced in *Pokémon Sun* and *Pokémon Moon*)\r\n-   _Dynamax_ (first introduced in *Pokémon Sword* and *Pokémon Shield*)\r\n-   _Terastal Phenomenon_ (first introduced in *Pokémon Scarlet* and *Pokémon Violet*)\r\n-   _Shadow Pokemon_ (first introduced in *Pokémon Colosseum* and refined in *Pokémon XD: Gale of Darkness*)\r\n-   _Delta Species_ (first introduced in the *Pokémon Trading Card Game*’s “EX Delta Species” set and expounded upon in fan-games preceding Gen 7, most notably *Pokémon Insurgence*)\r\n-   _Nuclear Type_ (introduced and popularized by the fan-game *Pokémon Uranium*)\r\n\r\n# Mega Evolution\r\n\r\n**Mega Evolution** is a type of transformation that Pokémon can undergo, operating as a temporary evolution rather than a more standard Forme Change. Broadly speaking, fully evolved Pokémon (and those without any evolutions) are capable of Mega Evolving. While certain extraordinary situations can trigger Mega Evolution for a time, the most reliable method is through the use of a set of Accessories, worn by a Pokémon and a trusted partner. The Pokémon must hold a **Mega Stone** with which it shares a <Species> Keyword, and the partner must possess a **Key Stone**, which is a Held Item that can be slotted into another piece of gear.\r\n\r\nFollowing the example of the official and many fan-made Mega Evolutions, this Phenomena acts much the same, but with tweaks to suit the modified approach to Pokémon builds. Similar to the way the more radical Forme Changes are handled, Mega Pokémon are classified as a separate <Species>, which provide:\r\n\r\n-   A different set of characteristics and Traits (usually expansions on what the creature originally had)\r\n-   An Extra Ability\r\n-   A different default Skill spread\r\n-   100 points spread out among the Pokémon’s Base Stats except for HP.\r\n\r\nThe Ability gained from Mega Evolution is always added as an _Extra Ability_ and doesn’t replace any Abilities already possessed by the Pokémon, However, in the scenario that a Pokémon already possesses the Extra Ability from another source, the Extra Ability provided by Mega Evolution is instead changed to one of the Starting, Basic, Advanced, Master Abilities it does not have active (user’s choice).\r\n\r\nMega Evolution may be initialized on either the Pokémon’s or its partner’s activation, via the “_Mega Evolve!_” Action. If either entity Faints before the Action resolves, the Pokémon does not Mega Evolve. Once successfully resolved, Mega Evolution lasts for the remainder of a combat, even if the user Faints. The Pokémon partner can alternatively disengage the Mega Evolution using the “_Power Down!_” action. A Key Stone can only Mega Evolve one Pokémon during a combat.\r\n\r\nOut of combat, a Pokémon may be Mega Evolved for up to a single Daytime Span, and may be de-Evolved early through the use of “Power Down!”. If the Mega Evolved Pokémon enters combat after Mega Evolving ahead of time, they are de-Evolved at the end of the combat. When a Pokémon Mega Evolves out of combat, they gain one Stack of Weary upon de-Evolving.\r\n\r\nThe Key Stone’s **PP Pool** can be used for the cost of “Mega Evolve!”, and any subsequent uses must be consumed by the player. The Key Stone has its PP Pool refilled during the Rest Action.\r\n\r\nWhile Mega Evolved, the Pokémon’s Mega Stone is absorbed into their body, meaning the item no longer occupies an Equipment Slot and cannot be taken from the user through the use of other creatures’ Actions and Abilities.\r\n\r\n# Z-Moves\r\n\r\nA **Zenith Move** (shortened to **Z-Move**) is a special type of Attack, in which a Pokémon and their partner’s wishes combine to unleash an Attack comprising the full power of both creatures. The partner focuses their will into an Accessory Item known as a Zenith Core, which magnifies and transmits ambient **Z-Power** into s **Z-Crystal** or **Z-Power-Crystal** that the Pokémon has equipped as an accessory, allowing the Pokemon to transform one of its Moves into a powerful Z-Move.\r\n\r\nDuring their Activation, the Pokémon’s partner can use the “_Z-Pose!_” Action to trigger the activation of a Z-Move that meets the criteria of the held Z-Crystal/Z-Power-Crystal. If either entity Faints before the Action resolves, the Action’s PP Cost is spent, but the effect fails to resolve. A Zenith Core can only power one Z-Move during a Combat. Zenith Cores recharge after a Combat resolves, and can be used during the next Combat.\r\n\r\nStandard Z-Crystals allow for the activation of the **\\[Zenith\\]** Attack associated with the <Type> of the Z-Crystal, provided the user has an Attack of that Type on their Active List. Physical- and Special-Category Attacks allow for one of the Type-Specific Z-Moves, and Status-Category Moves allow for the use of the Attack \"Zenith Power.\" Z-Power-Crystals, on the other hand, allow for certain Pokemon Species (and the members of their evolutionary lines) to use specific Z-Moves so long as they have a specific Attack on their Active List.\r\n\r\n# Dynamax\r\n\r\n**Dynamax** is a type of special physical transformation Pokémon can undergo, warping the space around them to change their size and affect the world around them, using the incredible power stored within a **Wishing Star**. Two prerequisites must be met before Dynamax can be applied to a Pokémon, however. First, the Pokémon’s partner must be Holding a Wishing Star or be wearing an Accessory Slot item containing a Wishing Star. Second, the Wishing Star must have accumulated enough energy to engage in the process. However, certain extraordinary situations can trigger Dynamaxes for a time, sometimes nearly indefinitely, sometimes involuntarily.\r\n\r\nDuring their Activation, the Pokémon’s partner can use the “_Max Lob!_” Action to Dynamax the Pokémon, or the Pokémon may use “_Become Giant!_” to Dynamax itself. If either entity Faints before the Action resolves, the Pokémon does not Dynamax, and the Wishing Star does not lose its charge, but the PP used for “Max Lob!” or “Become Giant!” is still consumed. Once successfully resolved, a Pokémon remains Dynamaxed for 5 Activations, and loses it prematurely if they Faint. The Pokémon’s partner can alternatively disengage Dynamax using the “Power Down!” action. A Wishing Star can only Dynamax one Pokémon during a combat.\r\n\r\nWhen a Pokémon Dynamaxes, it immediately grows to a truly large size: Medium and smaller Pokémon have their Size Category set to \"Titanic,\" and Large and larger Pokémon have their Size Category set to \"Max.\" Creatures that would be within the Dynamaxed Pokémon’s space are then pushed to the nearest unoccupied space that is not adjacent to the Dynamaxed Pokémon. If the Dynamaxed Pokémon would not be able to fit in the space around it at the end of this transformation, the user either shapes the area around it so it can occupy the space (often destroying objects and terrain), or is forcefully moved to a space it can safely occupy. This is done at the discretion of the GM.\r\n\r\nWhile Dynamaxed, a Pokémon:\r\n\r\n-   _Has its HP stat, after all other modifiers, doubled, and has its current HP set to the same percent it was at before Dynamaxing_ (rounded up)\r\n-   _Has all of its Movement Score increase by 10% per Size Category increase_ (so a Large Pokémon gains 50% to all of its Movement Types, while a Huge Pokémon gains 30%).\r\n-   _Has all of the Attacks on the their Active List temporarily replaced with **\\[Max\\]** Attacks while Dynamaxed_, which are provided based on the what is on their Active List prior to Dynamaxing:\r\n    -   \"Max Struggle,\" which replaces \"Struggle\"\r\n    -   \"Max Guard,\" which replaces all Status-Category Attacks.\r\n    -   <Type> \\[Max\\] Attacks, which are added corresponding to the <Type> of the Physical- and Special-Category Attacks Pokémon’s Active List\r\n    -   \"G-Max\" Attacks, if the Pokémon meets the Active List <Type> and <Species> requirement for those specific \\[Max\\] Attacks\r\n\r\nThe partner's Wishing Star’s **PP Pool** can be used for the cost of “_Become Giant!_”, and any subsequent uses must be consumed by the Pokémon using \"_Become Giant!_.\"\r\n\r\n> _Development Note_: mechanics regarding the recharge/replenishment of the Wishing Star are still forthcoming.\r\n\r\n# Terastal Phenomenon\r\n\r\n**Terastalization** is a type of enhancement and transformation that affects a Pokémon, blinging it out in a massive jewel and giving it extraordinary elemental power. Two prerequisites must be met before a Pokémon can Terastalize: a Pokémon's partner possesses a Held Item called a **Tera Orb**, and the Tera Orb must have accumulated enough energy to initiate and sustain the phenomenon.\r\n\r\nDuring their Activation, the partner creature can use the “_Crystal Pitch!_” Action to Terastalize the Pokémon. If either entity Faints before the Action resolves, the Pokémon does not Terastalize , and the Tera Orb does not lose its charge, but the PP used for “Crystal Pitch!” is still consumed. Once successfully resolved, the Pokémon is Terastalized until combat ends and loses it prematurely if they Faint. The Pokémon’s partner can alternatively disengage the Terastal Phenomenon using the “_Power Down!_” action.\r\n\r\nWhen a Pokémon Terastalizes, its Typing is completely overridden to its **Tera Type**. A Pokémon’s Tera Type is defined through a <Tera Type> Trait denoting which Tera <Type> it has. The Tera Type for a Pokémon is usually its inherent Type(s), but through special means a Pokémon can have a different Tera Type or be given a new one. When generated or caught, a Pokémon has an 80% chance for its Tera Type to be one of its default Type(s), and 20% to be any other base Type, including the Stellar-Type. GMs including Types beyond the original 18 and Stellar (such as Nuclear and Shadow) can choose to allow Pokémon to have Tera Types beyond the standard 18+1.\r\n\r\nTrainers with Type Sync can change a Pokémon’s Tera Type to match the Type(s) they have access to through Type Sync.\r\n\r\nWhile Terastilized, a Pokémon:\r\n\r\n-   _Cannot have its <Type>ing changed from its Tera Type_\r\n-   _Continues to receive STAB for its original <Type>s_\r\n-   _Receives an extra STAB for its <Tera Type>_\r\n    -   If the <Tera Type> is the same as one of the original <Type>s, this STAB doubles up.\r\n\r\n> _Development Note_: tenatively, we are **_not_** including the \"minimum Attack Power is 60\" effect from the mainline games.\r\n\r\nThe partner's Tera Orb’s **PP Pool** can be used for the cost of “_Crystal Pitch!_”, and any subsequent uses must be consumed by the Pokémon targetted by \"_Crystal Pitch!_.\"\r\n\r\n> _Development Note_: mechanics regarding the recharge/replenishment of the Tera Orb are still forthcoming.\r\n\r\n## Stellar-Type\r\n\r\nWhen a Pokémon Terastalizes into the **Stellar-Type**, it:\r\n\r\n-   _Still receives STAB for its original <Types>_\r\n-   _Gains a one-time extra STAB bonus for every Type_.\r\n    -   Once the Pokémon uses a Move of a given Type, it loses that extra STAB for that Type for the remainder of their Terastilization.\r\n\r\nThe \\[Stellar\\] <Type>:\r\n\r\n-   Possess no resistances\r\n-   Possess no weaknesses\r\n-   Has no Attacks that possess the <Type>\r\n\r\nLogistically, a Stellar-Type Pokémon has no Type-based weaknesses, though certain Moves and Abilities may allow separate increases in effectiveness.\r\n\r\n# Shadow Pokémon\r\n\r\n**Shadow Pokémon** are an unnatural phenomenon; the result of a Pokémon closing off its heart due to natural or artificial means. They are incredibly distrustful of people, and have been known to Attack anything unprovoked, including their own trainers. Though strong, they are stuck in a state where growth is impossible. Caution to any trainer that obtains one of these beasts.\r\n\r\n## Unique Traits and General Rules\r\n\r\nShadow Pokémon, as a result of the mechanism or phenomenon that granted them the Shadow Type, have had their “hearts shut”, transforming them into soulless fighting machines. Shadow Pokémon are creatures that possess the special **\\[Closed Heart\\]** Trait, which confers a number of effects and mechanics unique to them, which also include unusual behaviors and other qualities that GMs can utilize at their discretion.\r\n\r\nShadow Pokémon are special Pokémon that are strong in their own right, but this strength comes at the cost of their ability to grow like other Pokémon. There are a few key rules that accompany the \\[Closed Heart\\] trait:\r\n\r\n1.  These creatures have their SPD Stat (before combat effects) increased by 50%.\r\n2.  These creatures possess the _Extra Abilities_ \"Hyper Aggressive\" and \"Coldhearted.\"\r\n3.  They must have two (2) \\[Shadow\\] <Type> Attacks on their Active List at all times, but gain an extra slot in their Active List.\r\n4.  The creatures grow more slowly, being placed onto a slower experience track, shown in the \"Closed Heart Experience Tracks\" section, below.\r\n5.  These creatures add Shadow-Type Attacks to their Attack Repetoire as part of leveling, selected as though they were being Tutored. This allocation is shpwn in the \"Closed Heart Leveling Learnlist\" section, below.\r\n6.  Possess a unique Skill similar to Resources: “Anguish”, which governs the Shadow Pokemon’s resistance to Purification.\r\n7.  Are susceptible to entering Hyper Mode, a unique Minor Affliction.\r\n8.  They cannot utilize Evolution, or undergo miscellaneous transforms (Transform, Phenomena, etc.).\r\n\r\nClosed Heart Experience Tracks\r\n\r\nEXPPkmn\\=34LevelCurrent3EXP \\_{Pkmn} \\\\normalsize = \\\\large\\\\frac{\\\\normalsize 3}{\\\\normalsize 4} {Level\\_{Current}}^3 EXPPkmn​\\=43​LevelCurrent​3\r\n\r\nEXPHmnoid\\=53LevelCurrent3EXP \\_{Hmnoid} \\\\normalsize = \\\\large\\\\frac{\\\\normalsize 5}{\\\\normalsize 3} {Level\\_{Current}}^3 EXPHmnoid​\\=35​LevelCurrent​3\r\n\r\nClosed Heart Leveling Learnlist\r\n\r\n| Level | Num. of Attacks | Max Grade |\r\n| --- | --- | --- |\r\n\r\n```\r\n| 1 | x2 | E |\r\n```\r\n\r\n| 5 | x1 | D |  \r\n| 10 | x2 | D |  \r\n| 15 | x3 | C |  \r\n| 20 | x1 | B |  \r\n| 25 | x2 | B |  \r\n| 30 | x3 | B |  \r\n| 35 | x1 | A |  \r\n| 40 | x2 | A |  \r\n| 45 | x2 | A |  \r\n| 50 | x2 | S |  \r\n| 55 | x1 | S |  \r\n| 60 | x1 | S+ |  \r\n| 65 | x1 | S+ |  \r\n| 70 | x1 | S+ |  \r\n| 75 | x1 | S+ |  \r\n| 80 | x1 | S+ |  \r\n| 85 | x1 | S+ |  \r\n| 90 | x1 | S+ |  \r\n| 95 | x1 | S+ |  \r\n| 100 | x1 | S+ |\r\n\r\n## Hyper Mode\r\n\r\nHyper Mode is a Status Condition only able to be gained by \\[Closed Heart\\]. Hyper Mode occurs when the normally-composed and obedient \\[Closed Heart\\] loses that composure and its burgeoning emotions flare up and bubble over, causing its aggression to explode.\r\n\r\nA Pokémon has a chance to gain Hyper Mode after resolving a Shadow-Type Attack. The creature makes a Trivial Anguish Test, with the DC reduced by their Natural Tension times 5. If the creature rolls above the DC, they gain Hyper Mode.\r\n\r\nIn addition to the 5% chance to be cured of Hyper Mode at the start of their Activations, creatures may be cured by another creature’s “Call!” Action, and may be cured freely as part of a Camp Action.\r\n\r\n## The Shadow Type\r\n\r\nThe **\\[Shadow\\] <Type>** is an odd Type. It possesses neutral resistance to all other base Types, and is super effective against all other Types. It only exists on Attacks and some other Actions — it cannot be possessed by a creature as one of that creature’s Typings.\r\n\r\nShadow-Type Attacks are quite brutal in their nature, and the costs of their raw power is surprisingly minimal. Naming-wise, Shadow-Type Attacks have very decisive-sounding names, brutal and “safe” edgy.\r\n\r\nGenerally, Shadow-Type Attacks possess two intrinsic properties that differentiate them from other Attacks:\r\n\r\n1.  They are copies or Type-Shifts of existing Attacks.\r\n2.  They possess a reduced (usually halved) PP Cost.\r\n\r\n## Purification\r\n\r\nSimilar to Luck, \\[Closed Heart\\] creatures have the unique metacurrency/metaskill: **_Anguish_**. Upon gaining \\[Closed Heart\\], Anguish is set at 100. Through interacting with a caring partner and companions that appeal to their true nature, the creature’s Anguish is reduced. Upon hitting zero and taking part in a “Purification Ceremony” Downtime Action, the creature loses \\[Closed Heart\\] and gains \\[Triumphant\\]. Upon losing \\[Closed Heart\\], the creature loses all of the Shadow-Type Attacks it previously possessed alongside the other mechanics and benefits associated with the Trait.\r\n\r\nThere are a number of methods to reduce Anguish:\r\n\r\n### Exiting Hyper Mode\r\n\r\nWhen the creature is cured of Hyper Mode, their Anguish is reduced by the following:\r\n\r\nAnguishHyper\\=2d2Anguish\\_{Hyper} = 2d2 AnguishHyper​\\=2d2\r\n\r\n#### Positive Social Interactions\r\n\r\nCertain social interactions (such as urging the creature to play with their comrades, participate in a social gathering, etc.) also allow for Anguish to decrease.\r\n\r\nThe creature (or one creature among the group) working with the \\[Closed Heart\\] creature must make a **Hard Skill Test** using a Skill pertinent to the situation and interaction.\r\n\r\n### Reducing Anguish\r\n\r\nThe creature’s Anguish is reduced (or possibly increased) by:\r\n\r\nAnguishSocial\\=4+2∗DoS−RapportNaturalAnguish\\_{Social} = 4+2\\*DoS-Rapport\\_{Natural} AnguishSocial​\\=4+2∗DoS−RapportNatural​\r\n\r\n#### After Combat\r\n\r\nSuccess in overcoming tough opponents always strengthens the bonds between comrades.\r\n\r\nAfter participating in Combat, the creature makes a **Challenging Anguish Test**. The creature's Anguish decreases/increases by:\r\n\r\nAnguishCombat\\=2∗DoS+TensionNaturalAnguish\\_{Combat} = 2\\*DoS+Tension\\_{Natural} AnguishCombat​\\=2∗DoS+TensionNatural​\r\n\r\n#### Nightly Care\r\n\r\nWhile at Camp, a creature can try to care for the \\[Closed Heart\\] creature, working to open the door to its heart.\r\n\r\nThe creature (or one creature among the group) caring for the \\[Closed Heart\\] creature makes a **Challenging Husbandry Test** as part of a Downtime Action. The creature’s Anguish is reduced/increased by:\r\n\r\nAnguishCombat\\=3∗DoS+TensionNat−RapportNatAnguish\\_{Combat} = 3\\*DoS+Tension\\_{Nat}-Rapport\\_{Nat} AnguishCombat​\\=3∗DoS+TensionNat​−RapportNat​\r\n\r\n#### Applying Cologne\r\n\r\nWhen applying a \\[Cologne\\] item, reduce the target’s Anguish by the amount listed in item’s text.\r\n\r\n#### Special Intervention\r\n\r\nIn specific scenarios, a \\[Legendary\\] Pokémon, a creature with \\[Shadow Purification\\], or some other magical or technological force can intervene and aid in the reduction of the creature’s Anguish. Taking a Downtime Action with aid of a \\[Legendary\\] Pokémon or beneficent force reduces the creature’s Anguish by half the aiding creature/source’s Level, automatically performing a Purification Ceremony if it hits 0.\r\n\r\n### Purified Creatures\r\n\r\n\\[Triumphant\\] creatures gain the following bonuses:\r\n\r\n-   The \"Purifier\" Ability, provided freely.\r\n-   Their Level Track is returned to normal, and their Level is increased to the Level determined by their accumulated experience.\r\n-   The creature adds 1+ Level/10 Tutor Attacks that they qualify for to their Repertoire, which is retroactive and applies as they continue to grow.\r\n-   These creatures get access to Luck, and may use Luck as Players and Aces do. Instead of recovering 1d10 Luck at the end of session, they only recover 1d4 Luck.\r\n\r\n### Special Shadow Pokémon\r\n\r\nCertain \\[Closed Heart\\] creatures may have their hearts bound tighter in order to maintain their immense power, or maybe their capabilities as a Shadow Pokémon are simply beyond the pale. Or maybe they’re particularly unique Shadow Pokémon, having undergone a revolutionary process to give them power or make them extremely difficult to Purify.\r\n\r\nAs further options, encountered \\[Closed Heart\\] creatures may also possess the **\\[Apex\\]** or **\\[XD\\]** Traits. **\\[Apex\\]** is designed to be possessed by certain particularly powerful Shadow Pokémon, such as the Cipher Admins’ signature Shadow Pokémon in Colosseum and Gale of Darkness. **\\[XD\\]** meanwhile, would be possessed by exemplary, nigh-on perfect fighting machines like the Lugia in Gale of Darkness: XD-001.\r\n\r\nThe \\[Apex\\] Trait confers the following:\r\n\r\n1.  A calculative Level increase of +10.\r\n2.  Anytime Anguish would change, Anguish increases by +2.\r\n3.  +20% to all Movement Scores.\r\n4.  +2 required number of \\[Shadow\\] Attacks on Active List.\r\n5.  +1 Active List Slot.\r\n\r\nThe \\[XD\\] Trait confers the following:\r\n\r\n1.  A calculative Level increase of +30.\r\n2.  Anytime Anguish would change, Anguish increases by +6.\r\n3.  +40% to all Movement Scores.\r\n4.  +4 required number of \\[Shadow\\] Attacks on Active List.\r\n5.  +2 Active List Slot.\r\n\r\nLike with \\[Closed Heart\\], \\[Apex\\] and \\[XD\\] are lost upon Purification.\r\n\r\nFor both \\[Apex\\] and \\[XD\\], it is recommended that, in order to differentiate them from baseline \\[Closed Heart\\], GMs should consider including additional boons, either while still \\[Closed Heart\\], upon Purification, or as part of \\[Triumphant\\]:\r\n\r\n-   Provide access to additional homebrewed Shadow-Type Attacks for their specific use; Type-Shifting existing Attacks (for \\[Legendary\\] Pokemon, it is recommended to Type-Shift their signature Attacks), improve existing or Type-Shifted-to-Shadow Attacks, or create new, substantial Shadow-Type Attacks entirely (both ideal for particularly powerful \\[XD\\] specimens).\r\n-   Confer a second Extra Ability of the GM’s choice (better for \\[XD\\], but can still be provided to \\[Apex\\]).\r\n-   Provide innate, passive increases to one or more Stat stages.\r\n-   Increase the amount of free, special Tutored Attacks upon Purification.\r\n-   Provide innate Base Stat increases or have the effective Level for Stat Calculations and obedience be higher while \\[Closed Heart\\], or persist entirely or in some fashion upon gaining \\[Triumphant\\].\r\n-   Allowing the \\[Triumphant\\] \\[Pokémon\\] retain 1 or more Shadow-Type Attacks.\r\n\r\n## Other Optional Rules\r\n\r\n> Still in progress.\r\n\r\n\\[Ultra\\] and \\[Paradox\\] \\[Pokémon\\] cannot be given the \\[Closed Heart\\] Trait.\r\n\r\n# Delta Species\r\n\r\nFirst conceived as “ẟ Delta Species” for the Pokémon TCG, **Delta Species** Pokémon (**Deltas** or **Delta Pokémon** for short) predate the idea of “regional variants.” Where the regional variants are more… reasonable in terms of their differences in morphology and changes in Typing and Abilities, Delta Species are very different in terms of Typing, Abilities, and general appearance but still closely resemble the species they’re modified from, maintaining a similar silhouette, sharing similar size and weight, and keeping nearly-identical Base Stats. In this way, they’re essentially the midpoint between regional variants and the Paradox Pokémon.\r\n\r\nLike regional variants, Deltas had a similar surge in the fan community after their introduction, leading to a ton of creative works in their wake, most notably coalescing into the roster of Delta Pokémon introduced in the Pokémon Insurgence fan-game.\r\n\r\nDelta Pokémon, for all intents and purposes, are just more exotic regional variants that are generally unnatural-looking, and are frequently more battle-capable than their original version. The lore for them in both the TCG and in Insurgence dictates them being anomalous and rare. It is recommended that should GMs utilize Delta Species Pokémon, they do so understanding their fairly unusual position relative to other Pokémon, and should utilize them considering possible ramifications to their campaign setting and story and possible in-combat balance.\r\n\r\n# Nuclear Type\r\n\r\nThe **Nuclear Type** is a <Type> introduced in the fan-game Pokémon Uranium. There are a number of Pokémon exclusive to Uranium that possess the \\[Nuclear\\] <Type> innately, and have pertinent Attacks and Abilities.\r\n\r\nUnlike standard types, Nuclear possesses similar corruptive properties to Shadow Pokémon. Regular Pokémon that are exposed to an undue amount of radiation will become corrupted and feral, turning a different color and gain the Trait \\[Contaminated\\]. Unlike \\[Closed Heart\\], however, those who have become corrupted can evolve and undergo miscellaneous transformations.\r\n\r\n\\[Contaminated\\] creatures simply gain the \\[Nuclear\\] Type. Through special mechanical processes, generally through working with special scientists or being a skilled scientist yourself, \\[Contaminated\\] can be cured and the creature returned to their normal state.\r\n\r\nUnlike the Shadow-Type, the Nuclear-Type functions much more like a normal Typing. Offensively, Nuclear Attacks are super effective on all standard Types except Steel and Nuclear itself. Defensively, Nuclear is weak to all other Types and resists itself. As is evident, Nuclear is simultaneously very dangerous but also extremely volatile, making \\[Nuclear\\] Pokémon more prone to being glass cannons.\r\n\r\nWe recommend GMs exercise caution with making Nuclear-Type available in their campaign. While less mechanically-involved than Shadow Pokémon, Nuclear is also potentially campaign- and balance-warping.","format":2}},{"name":"size-and-weight","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Size and Weight\r\ndescription: For all your needs regarding longth and girth!\r\npublished: true\r\ndate: 2024-06-12T11:37:41.751Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-05-20T17:20:35.545Z\r\n---\r\n\r\n# Height and Weight\r\nTo work more precisely, have rigid structures in place, and encourage some of the enticing mechanics and situations from the games and anime, this is how we’re choosing to handle height, weight, Weight Class (WC), and Size for humans and Pokemon.\r\n\r\nTo account for those that love their random generators and those that like to set everything themselves, humans generally have their height and weight set by the GM or Player, while Pokemon are generally auto-generated.\r\n\r\n**Height** is measured in meters at its core. Height is displayed in cm if a creature is less than 3 m long/tall, with a GM toggle (eventually) to display either or both metric (m) and imperial units (ft’ in”).\r\n\r\n**Weight** is measured in kilograms at its core. Weight is displayed in g if something weighs less than 1 kg, with a GM toggle (eventually) to display either or both metric (kg) and imperial units (lbs).\r\n\r\nEventually, we plan for 2e to provide randomized heights and weights for created creatures, to replicate the *Let’s Go Pikachu and Eevee* feel, and provide some variability. The below formulae are our tenatative formulae for this purpose.\r\n\r\n<details>\r\n  <summary> Tentative Height and Weight Randomization Guidelines </summary>\r\n  \r\n  ##### Human Height\r\n-   Average Male Height = *1.77 m*\r\n-   Average Female Height = *1.63 m*\r\n-   Approximated Standard Deviation Male = *0.06421 m*\r\n-   Approximated Standard Deviation Female = *0.05716 m*\r\n-   ProbH = *d2000*\r\n  \r\n  **Height** = *NORMINV(ProbH / 2001, Average Height, StdDev)*\r\n  \r\n  The above formula calculates a random probability, and uses the inverse normal distribution function to find where that probability charts the person's height.\r\n  \r\n  ##### Human Weight\r\n-   Mean BMI Male = *26.6 kg/m^2^ *\r\n-   Mean BMI Female = *24.0 kg/m^2^*\r\n-   Approximated Standard Deviation Male = *3.31 kg/m^2^*\r\n-   Approximated Standard Deviation Female = *4.18 kg/m^2^*\r\n-   ProbW = *d2000*\r\n  \r\n  **Weight** = *NORMINV(ProbW / 2001, MeanBMI, StdDev) x Height^2^\r\n  \r\n  The above formula calculates a random probability, and uses the inverse normal distribution function to find where that probability charts the person's weight, based on the height calculated above, or one input manually.\r\n  \r\n  ##### Pokemon Height\r\n  \r\n-   ProbH = *2d1000*\r\n\r\n  **Height** = *((ProbH/2000) x 0.8 + 0.6) x SpeciesAverage*\r\n  \r\n  The above formula is mostly reverse-engineered from *Let’s Go Pikachu and Eevee*, with the \"SpeciesAverage' being the value listed on the Species Item for a Pokemon, which is itself taken from  official Pokedex sources.\r\n  \r\n  ##### Pokemon Weight\r\n  \r\n-   ProbW = *2d1000*\r\n\r\n  **Weight** = *((ProbW / 2000) x 0.4 + 8) x Height x SpeciesAverage*\r\n  \r\n  The above formula is mostly reverse-engineered from *Let’s Go Pikachu and Eevee*, with \"Height\" being the value calculated above (or input manually), and the \"SpeciesAverage' being the value listed on the Species Item for a Pokemon, which is itself taken from  official Pokedex sources.\r\n  \r\n </details>\r\n\r\n# Weight Class (WC)\r\n**Weight Class (WC)** is a mechanic to be used for the purposes of carry capacity and similar mechanics. Currently, it is purpose build for the mechanics of a number of attacks and abilities. WC is calculated (evenutally automatically) based on the total weight of a creature, plus its equipped items.\r\n\r\nFor the below chart, a creature's WC is determined based on the first weight threshold it meets, starting from WC 1.\r\n\r\n<details>\r\n  <summary> Weight Class Thresholds </summary>\r\n\r\n| Weight Class | Weight Threshold (kg) | Weight Class | Weight Threshold (kg) |\r\n| :-----: | :------: | :-----: | :------: |\r\n| **1** | < 10 | **9** | < 120 |\r\n| **2** | < 20 | **10** | < 145 |\r\n| **3** | < 30 | **11** | < 190 |\r\n| **4** | < 40 | **12** | < 240 |\r\n| **5** | < 55 | **13** | < 305 |\r\n| **6** | < 70 | **14** | < 350 |\r\n| **7** | < 85 | **15** | < 410 |\r\n| **8** | < 100 | **16** | >= 410 |\r\n\r\n</details>\r\n\r\n# Size\r\n**Size** is what determines the actual dimensions of a creature’s token on a tactical map and all other associated mechanics.\r\n\r\n### Size Category Determination\r\nA creature’s \"Base Height\" (the one listed on the Actor's Sheet) is modified depending on how it’s measured, either being measured by the creature’s _length_ (like a snake or a fish) or a creature’s withers/shoulders (like dogs or horses). Certain creatures, like many Legendary Pokemon, or strangely bulky Pokemon, are usually measured as _quadrupeds_. These are listed on a creature's Species Item as `height`, `length` and `quad`. \r\n\r\nWith this, when determining a creature's Size Category, the creature's \"Base Height\" is multiplied via the below formulae, which is then compared to the different Height Thresholds for the Size Categories.\r\n  \r\n$\r\n\\large Height_{Length} = \\Large{\\frac{Height_{Base}}{\\sqrt{2}}} \\;\\;\\;\\;\\;\\;\\;\\;\\; \\large Height_{Length} = Height_{Base} * \\Large{\\frac{3+2*\\sqrt{2}+\\sqrt{5}}{4}}\r\n$\r\n\r\nTo determine a creature’s Size, based on the below table:\r\n1. Start at Diminutive.\r\n2. If height is less than the upper thresholds for that Size Category, the creature is that size. If not, go to the next Size Category.\r\n3. Repeat Step 2 until you find the creature’s suitable size.\r\n\r\nCreatures may only be at most *Titanic* in Size naturally.\r\n  \r\nThe table, below, lists **Size Category** determinations for creatures based on the value listed on their Actor Sheet (which is, by default, the Species' average).\r\n\r\n<details>\r\n  <summary> Size Category Determinations Table </summary>\r\n  \r\n  | Size Category | Height Threshold | Effective Height Threshold (Length) | Effective Height Threshold (Quad) |\r\n  | :-------: | :-------: | :-------: | :-------: |\r\n  | _**Diminutive**_ | < 0.3048 | < 0.5279 | < 0.1512 |\r\n  | _**Tiny**_ | < 0.6858 | < 1.1878 | < 0.3402 |\r\n  | _**Small**_ | < 1.3208 | < 2.2877 | < 0.6551 |\r\n  | _**Medium**_ | < 3.048 | < 5.2793 | < 1.5118 |\r\n  | _**Large**_ | < 5.4864 | <9.5027 | < 2.7213 |\r\n  | _**Huge**_ | < 10.9728 | < 19.0054 | < 5.4425 |\r\n  | _**Gigantic**_ | < 16.4592 | < 28.5082 | < 8.1638 |\r\n  | _**Titanic**_ | - | - | - |\r\n  | _**Max**_ | - | - | - |\r\n  \r\n </details>\r\n \r\n## Size Category-Associated Mechanics\r\nSize Categories are involved with a number of other statistics and mechanics.\r\n\r\n<details>\r\n  <summary> Size Category Statistics Table </summary>\r\n  \r\n  | Size Category | Token Side Length (m) | Category Modifier (CatMod) | Reach (m) | Range Multiplier | Wide Line Width (m) |\r\n  | :-------: | :-------: | :-------: | :-------: | :-------: | :-------: |\r\n  | _**Diminutive**_ | 1/4 | 0 | 1 | x1.00 | 2 |\r\n  | _**Tiny**_ | 1/2 | 1 | 1 | x1.00 | 2 |\r\n  | _**Small**_ | 3/4 | 2 | 1 | x1.00 | 3 |\r\n  | _**Medium**_ | 1 | 3 | 1 | x1.00 | 3 |\r\n  | _**Large**_ | 2 | 4 | 2 | x1.10 | 4 |\r\n  | _**Huge**_ | 3 | 5 | 3 | x1.20 | 4 |\r\n  | _**Gigantic**_ | 4 | 6 | 4 | x1.30 | 5 |\r\n  | _**Titanic**_ | 5 | 7 | 5 | x1.40 | 5 |\r\n  | _**Max**_ | 6 | 8 | 6 | x1.50 | 6 |\r\n  \r\n</details>\r\n  \r\n### Category Modifier\r\nThis value, numbering from 1 to 8, is associated with a number of other mechanics based off Size. To compare this to other systems, the **Category Modifier** is more akin to a \"Size Bonus\" or \"Size Rank\", in that it influences numbers and statistics elsewhere. This is referred to in other areas in the rules as a creature's **CatMod**, in shorthand.\r\n  \r\n### Token Size\r\nEach Actor has a specific token/actor size when placed onto the board, dependent on their Size Category. Each creature has a token side length of X metres, with Medium sized creatures having tokens that are 1m x 1m (generally, one square in size).\r\n\r\n### Reach\r\nA creature’s Reach (basically the length of its limbs) determines the Range of the creature’s [Contact] attacks. This value is  equal to:\r\n  \r\n$\r\n   Reach=max(CatMod-2, 1)\r\n$\r\n\r\n### Size-Based Range Increases\r\nThe Range of the user’s non-[Contact], non-Burst/Emanation attacks increase based on the creature’s size (due to greater output of energy, etc.), equal to:\r\n  \r\n$\r\n   Range_{Mult} = 1+\\Large\\frac{max(CatMod-3, 0)}{10}\r\n$\r\n\r\n### Wide Line Template\r\nThe width of the template for \"Wide Line\" attacks and effects is also dependent on a creature's Size Category, as follows:\r\n\r\n$\r\n   Width_{WL} = 2+\\big\\lfloor CatMod/2 \\big\\rfloor\r\n$\r\n\r\n### Size Increases to HP\r\nA creature’s HP calculation is modified by their Size Category, specifically their CatMod. Their **BulkMod** is expressed as:\r\n$\r\n  BulkMod= \\Big(\\large1+\\Large\\frac{\\sqrt{2}-1}{30/\\pi}\\Big)^{\\small{CatMod}}\r\n$\r\n\r\n### Differences in Accuracy\r\nCreatures are treated as having +1 additional ACC stage when targeting creatures with a CatMod that is 2 greater than their own. Conversely, creatures are treated as having -1 reduced ACC stage when targeting creatures with a CatMod that is 2+ fewer than their own.","format":2}},{"name":"skills","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Skill Checks & Luck\r\ndescription: What are they and how do they work?\r\npublished: true\r\ndate: 2024-06-12T11:33:14.780Z\r\ntags: rules, skills, checks\r\neditor: markdown\r\ndateCreated: 2024-04-19T10:01:58.362Z\r\n---\r\n\r\n# Skill Checks\r\n\r\nRolling for Skill Checks is fairly simple. The base Difficulty Check (**DC**) of the roll is equal to the level of the actor's relevant skill. The DC is further modified by the Challenge Rating (**CR**) applied by the current situation or circumstances. After finding the Final DC, the actor is aiming to _roll equal to or lower than the final result for a success_. Rolling higher than the final DC will result in a failure.\r\n\r\nFor example, a player is attempting to conceal an item without anyone noticing. Their Sleight of Hand is at 60. For the sake of this section let's say nothing else hinders or helps the situation, giving a final DC of 60 for the roll. The player rolls a d100 Sleight of Hand roll and gets a 50, meaning they pass the check and are successful in concealing the item.\r\n\r\n> **_GM TIP_**: A good rule when deciding if something should be a skill check is to consider how often the situation can occur in day to day life. If the situation is a common enough occurrence, then a skill check is not required. You wouldn’t need to roll a check to open an unlocked door, but may need to roll a check to break a door down if it is locked or barricaded. Always use your best judgment when calling for a skill check.\r\n\r\n> **_Foundry Tip:_** In foundry checks are rolled using the formula `1d100ms@dc`, which basically is the same as `d100-@dc`, but with a small twist, you may ask, what does `ms` stand for? Well it stands for 'Margin of Success' which the official Foundry KB Article describes as:\r\n> \r\n> > This modifier subtracts a target value set by the user from the result of the dice rolled, and returns difference as the final total. If the amount rolled is less than the target it outputs a negative number, and a positive number if there is a remainder after subtraction.\r\n> \r\n> Basically what this means is that in the roll result you will always see the 'net' result, so if you have 40 in a skill, and roll a 35, the result will show `-5` as that is your 'Margin of Success'.\r\n\r\n## Challenge Rating\r\n\r\nThe Challenge Rating is a set of modifiers that increase or decrease the DC of a skill check. Things like weather, type of terrain, the action being attempted, etc. can alter how easy or how difficult a skill check can be. These modifiers are as follows:\r\n\r\n-   Trivial: +40\r\n-   Easy: +30\r\n-   Simple: +20\r\n-   Average: +10\r\n-   Challenging: no modifier\r\n-   Difficult: -10\r\n-   Hard: -20\r\n-   Intense: -30\r\n-   Almost Impossible: -40\r\n\r\nWhen deciding the challenge rating for a check, consider how easy or difficult the situation may be for something without proper training than basing it off any individual player character’s aptitude. If the situation would be difficult to overcome, then it has a Difficult Challenge Rating for anyone attempting the skill check.\r\n\r\n## Degree of Success\r\n\r\nMany times, it is useful to know by how much you succeed, as if you superlatively succeed at a task in the dice, that should have a mechanical effect too! Success (and failure) can be measured by **degrees**. Basically, for every 10 points by which you exceed the DC of a skill test and succeed at a roll, you are considered to have an additional degree of success (DoS) on that skill test.\r\n\r\nEach additional degree of success should have some sort of impact on the magnitude of success to a skill test, so when you make a test to, say, leap across a raging, flooded river and its rocks, succeeding at a Acrobatics check by <10 (1 DoS) would have you successfully do so, albeit very slowly. Succeeding by 53 (6 DoS) would have you clear the obstacle deftly, quickly, and avoiding getting your clothes wet! Or, perhaps, giving you the advantage to avoid possible debris or aggressive Pokemon also caught in the flood outright (where if you failed to make the jumps as fast, you’d have to make those subsequent tests too)!\r\n\r\nCertain Perks, Traits, Abilities, and Status Conditions may add or remove degrees of success/failure for certain skills, or even specific applications of a given skill.\r\n\r\n# Luck\r\n\r\n**Luck** is your anime protagonist style plot armor. It gives the ability to manipulate a skill check, and a few other aspects of the game. Luck is a resource that only Player Characters and Aces have. At character creation, a player determines their initial luck by rolling 3d6 and multiplying the result by 5.\r\n\r\n## Spending Luck\r\n\r\nThere are two ways a player can utilize Luck. Note that when Luck is spent, the player’s Luck decreases depending on how it is spent. Luck can only be spent once per roll.\r\n\r\n**_Fortune_** - Whenever a creature fails a Skill Check, Accuracy Check, or Effect Check, they can spend a number of their Luck equal to how far off they were from succeeding to change it to a success. This means that if a player rolled a 45 on a DC 40 check, they can spend 5 luck to change it to a success.\r\n\r\nFortune is not limited to changing a failure to a success. A player can also choose to increase their degree of success by spending the amount of Luck needed.\r\n\r\n**_Push Your Luck_** - On a failed Skill Check, a player can choose to Push their Luck. This allows them to reroll the failed check, provided the player offers a way for the situation to worsen if they fail a second time. Luck cannot be spent on this reroll.\r\n\r\n## Lucky Break\r\n\r\nIn any game, players may encounter a scenario where a skill check won’t give them the right answer, or they are simply rolling poorly. These are the times where a GM can offer a Lucky Break. This works the same as a skill check where the players roll a d100 Luck roll, using their current Luck as the DC. Unlike skill checks, CR is not applied to a Lucky Break, and players cannot spend Luck to alter the result of a Lucky Break, nor use Push Your Luck on this roll.\r\n\r\nLucky Breaks are perfect for giving players a hint on how to solve a puzzle they have been stuck on. They can also be used to present Pokemon that players were searching for outside of normal circumstances. They can also be used to alter the CR of a following skill check. There isn’t a wrong way to use a Lucky Break, but we recommend to use these sparingly or for when the session may start slowing down to a crawl.\r\n\r\nWhen a Lucky Break is called, any player that agrees to take it rolls their check. At least 1 player needs to agree to take a Lucky Break to continue. On a success, grant the players character some meta knowledge you feel is appropriate for them to use, or whatever reward you feel is appropriate for the current situation. For a group roll, count the number of successes, treating the player with the lowest Luck’s success twice. If the number of successes is greater than half the rolls made, the Lucky Break is treated as an overall success.\r\n\r\n> As a general rule, do not penalize players for failing a Lucky Break roll. Completely failing this just means they may need to rethink their approach or return when they are better prepared.\r\n\r\n## Recovering Luck\r\n\r\nAt the end of each session, Players roll a d100 with their current Luck as the DC, succeeding on a roll that is greater than or equal to the DC. On a success, they recover 1d10 Luck. _Players and Aces cannot have more than 100 Luck._\r\n\r\n> **_Dev Note_**: This does mean that players with lower Luck have a higher chance of recovering it at the end of a session. This is intended so players feel more incentive to spend Luck. In fact we encourage players to spend it as much as possible!","format":2}},{"name":"social-encounters","title":{"level":1,"show":true},"text":{"markdown":"---\r\ntitle: Social Encounters\r\ndescription: Non-combat \"encounters\", relationships, and more!\r\npublished: true\r\ndate: 2024-06-12T11:38:13.610Z\r\ntags: \r\neditor: markdown\r\ndateCreated: 2024-05-19T16:08:39.889Z\r\n---\r\n\r\n## Social Encounters\r\nCharacters can be persuaded to follow any course of action (though the more ridiculous the request, the more difficult the Skill Checks!). This could be convincing them to fight alongside you for a battle, allow themselves to be captured or recruited (in the case of Pokémon), hand over an item, flee, stand aside, stop fighting, or much more. These outcomes can be achieved through any skill that could reasonably convince the target of your goal, and the relevant skills can change throughout the negotiation if the method or situation calls for it.\r\n\r\n### Step 1: Identify the target’s Rapport & Tension Clocks.\r\n\r\n- **Rapport** indicates how difficult it is to build rapport, and convince the target to fulfill a request or follow a course of action. The higher the number, the harder it is to cause this outcome.\r\n\r\n- **Tension** indicates how difficult it is to develop tension, and cause the target to react poorly to your attempts at persuasion. The higher the number, the harder it is to cause this outcome.\r\n\r\nBoth values are initially set based on the Nature of the target creature (outlined in the Natural Rapport and Tension Table further below). When convincing more than one individual, instead consult the Crowd Table further below.\r\n\r\n### Step 2: Establish the goal and modify clocks.\r\n\r\nClarify what it is you want the target to do. Depending on how reasonable or absurd the action is, and how much it conflicts with the target’s personal goals, the Challenge Rating, Rapport, and Tension are all modified according to the Goal Table further below. If the goal is not within the table, the GM may use the closest approximate goal or come up with their own values to use. _Clocks may not be lowered below 1_.\r\n\r\nWhile the goal can shift during persuasion (such as going from “Pull that lever” to “Throw a rope around the lever to pull it”), if it is significantly modified (such as going from “Pull that lever” to “Prevent anyone from pulling the lever”) the Rapport clock resets. Note that this does **not** reset the Tension clock.\r\n\r\n### Step 3: Make appropriate Skill Checks depending on your goal.\r\nAs with other clocks, a Skill Check must be performed as a Complex Action to fill them. This Skill Check can be any relevant skill that the GM deems could reasonably move the target to act in the manner you wish. If the GM determines the chosen Skill and/or persuading mechanism is particularly appropriate (or inappropriate) given the situation, the Challenge Rating of the Skill Check may be modified too. Asking a sworn villain to join your side is likely to be Almost Impossible, while persuading a lifelong companion to retrieve an item for you will probably be Trivial. Additionally, if a favor or gift is offered in exchange for the request the GM may choose to lower the Challenge Rating or even completely fill an additional Span if the gesture is meaningful enough. Conversely, taking actions the target would find unpleasant can have the opposite effect, increasing the Challenge Rating or filling a span of the Tension clock.\r\n\r\nEach successful Skill Check fills the Rapport clock by 1 Span, 2 if it is passed with 3+ DoS, and 3 if it is passed with 6+ DoS. The opportunity provided by a critical success may be used to fill 2 additional Spans.\r\n\r\nConversely, each failed Skill Check fills the Tension clock by 1 Span, 2 Spans if it fails with 3+ DoF, and 3 Spans if it fails with 6+ DoF. The opportunity provided by a critical failure may be used to fill 2 additional Spans.\r\n\r\n### Step 4: Conclusion\r\nOnce a clock fills completely, the target acts accordingly:\r\n- **Rapport**: The target follows the suggested course of action, and develops a bit more rapport with the character(s) who put it forward. The Rapport clock for the target permanently lowers by 1, to a minimum of 3. The Tension clock for the target permanently raises by 1. If the target was a crowd, only the collective group’s clock is affected, not the individuals who comprise it. Both clocks reset progress.\r\n- **Tension**: The target grows irritated, scared, bored, or otherwise displeased with the character(s) who put the course of action forward, potentially even becoming hostile. The Tension clock for the target permanently lowers by 1, to a minimum of 3. The Rapport clock for the target permanently raises by 1. Both clocks reset progress.\r\n\r\n> _**GM Note**_: In general, a target whose Tension clock was met should react in a narratively interesting way that does not align with the persuading character’s goals. A target being asked to instigate a fight with a third party may instead turn their ire on the persuading character. Inversely, a foe being talked down from a fight may comply, but then commit to a new action that antagonizes the persuading character further than battle itself, such as endangering a defenseless ally. It’s also reasonable for the target to simply become bored and wander off, or even become frightened and flee if they were being spoken to roughly during an attempt to befriend them. Any outcome is valid, so long as it does not satisfy the persuading character’s wishes and simultaneously moves the story forward.\r\n{.is-info}\r\n\r\n## Skill Guidance\r\n\r\n_Conversation_ - Used in general social interaction with an eye to using positive approaches to get what you want, such as persuading someone.\r\n\r\n_Intimidate_ - Used in negative social interactions to bully someone into giving you what you want.\r\n\r\n_Negotiation_ - Used to cut a deal with someone who is not interested in being persuaded, but can potentially be bought out. Used both 'offensively' and 'defensively'.\r\n\r\n_Psychology_ - Used to defend yourself from manipulation by others, through recognising behaviours. Opposes Conversation and Intimidate.\r\n\r\n## Player Persuasion (Optional)\r\n\r\nAt GM discretion, player characters may be persuaded just like any other character. This should be approached very carefully - robbing players of agency is a dangerous way to play, and can easily lead to resentment. If this is done, it should be heavily supported by the story, and not force a player to act in a way they detest. The targeted player may make a relevant Skill Check to lower their own Rapport clock or raise their own Tension clock. Each success lowers the Rapport clock by 1 Span, 2 for 3+ DoS, and 3 for 6+ DoS. Each failure lowers the Tension clock by 1 Span, 2 for 3+ DoF, and 3 for 6+ DoF. If the Rapport clock fills, the course of action must be followed to the spirit of the request, though the player’s clocks do not permanently adjust. If the Tension clock fills, the character may react however they like, and can not be persuaded again by the instigating character until after the next interlude.\r\n\r\n# Tables\r\n## Natural Rapport and Tension Table\r\n**A creature's Natural Rapport and Tension are based on their Nature, and inform the baseline for each Social Stat's starting Social Clocks.**\r\n\r\n| NATURE | Rapport | Tension | NATURE | Rapport | Tension |\r\n| :-----------: | :-----------: | :-----------: | :-----------: | :-----------: | :-----------: |\r\n| **Cuddly** | 3 | 6 | **Distracted** | 6 | 6 |\r\n| **Proud** | 7 | 5 | **Decisive** | 3 | 3 |\r\n| **Patient** | 6 | 9 | **Desperate** | 3 | 6 |\r\n| **Lonely** | 5 | 6 | **Adamant** | 6 | 4 |\r\n| **Naughty** | 7 | 3 | **Brave** | 6 | 6 |\r\n| **Stark** | 6 | 4 | **Bold** | 4 | 4 |\r\n| **Impish** | 6 | 3 | **Lax** | 5 | 7 |\r\n| **Relaxed** | 4 | 7 | **Curious** | 5 | 8 |\r\n| **Modest** | 8 | 5 | **Mild** | 6 | 6 |\r\n| **Rash** | 5 | 3 | **Quiet** | 8 | 8 |\r\n| **Dreamy** | 7 | 8 | **Calm** | 4 | 7 |\r\n| **Gentle** | 3 | 6 | **Careful** | 8 | 6 |\r\n| **Sassy** | 8 | 5 | **Skittish** | 7 | 4 |\r\n| **Timid** | 7 | 6 | **Hasty** | 4 | 4 |\r\n| **Jolly** | 3 | 7 | **Naive** | 3 | 8 |\r\n| **Composed** | 6 | 6 | **Hardy** | 6 | 6 |\r\n| **Docile** | 3 | 9 | **Bashful** | 5 | 7 |\r\n| **Quirky** | 7 | 7 | **Serious** | 9 | 3 |\r\n\r\n## Crowd Table\r\n**These are the starting Social Clocks for influencing groups, as broken down by Crowd Size.**\r\n| Crowd Size | Rapport | Tension |\r\n| :-----------: | :-----------: | :-----------: |\r\n| Small (2-10 individuals) | 6 | 6 |\r\n| Medium (11-25 individuals) | 8 | 8 |\r\n| Large (26-50 individuals) | 10 | 10 |\r\n| Sizeable (51-100 individuals) | 12 | 12 |\r\n| Massive (101-300 individuals) | 15 | 15 |\r\n| Staggering (301-999 individuals) | 25 | 25 |\r\n| Monumental (1000+ individuals) | 40 | 40 |\r\n\r\n\r\n## Goal Table\r\n**These detail the CR and Social Clock modifiers for a number of situations, to serve as a benchmark and guideline for GMs to set CRs.**\r\n| Convincing a(n)... | Challenge Rating | Rapport | Tension |\r\n| :----------- | :----------- | :-----------: | :-----------: |\r\n| Enemy to betray their allies | Almost Impossible (-40) | +9 Span | -6 Span | \r\n| Wild pokemon to be captured | Almost Impossible (-40) | +2 Span | +0 Span | \r\n| Enemy to surrender/flee a fight | Almost Impossible (-40) | +3 Span | -3 Span | \r\n| Individual to give you a valuable item for free | Almost Impossible (-40) | +2 Span | -3 Span | \r\n| Individual to trade at a staggering discount (81-99% discount on their items’ true value) | Almost Impossible (-40) | +1 Span | -2 Span |\r\n| Individual to trade at a ludicrous discount (51%-80% discount on their items’ true value) | Intense (-30) | +1 Span | -2 Span | \r\n| Individual to offer a steep discount (21%-50% discount on their items’ true value) | Hard (-20) | +0 Span | +0 Span |\r\n| Individual to offer a slight discount (1%-20% discount on their items’ true value) | Challenging (+0) | +0 Span | +0 Span |\r\n| Individual to stop doing an important task for some time (like guarding a door, checking for contraband, or checking food for poison) | Intense (-30) | +2 Span | -2 Span |\r\n| Manic or hostile individual to calm down | Intense (-30) | +2 Span | -4 Span |\r\n| Angry mob to calm down | Almost Impossible (-40) | +4 Span | -5 Span |\r\n| Crowd to rally behind a cause that directly clashes with their morals | Intense (-30) | +3 Span | -3 Span |\r\n| Crowd to rally behind a cause that somewhat clashes with their morals | Hard (-20) | +1 Span | -2 Span |\r\n| Crowd to rally behind a cause that does not oppose their morals | Hard (-20) | +0 Span | +0 Span |\r\n| Group of police officers that you’re not the criminal they’re looking for | Intense (-30) | +3 Span | -1 Span |\r\n| Group of Pokemon that you mean no harm | Average (+10) | +0 Span | +1 Span |\r\n| Ally to perform a small favor (pulling a lever, handing over an item of insignificant value, or helping you perform a safe, legal action) | Simple (+20) | -1 Span | +3 Span |","format":2}}],"flags":{}}]